export const bubbles: any = {
    "year": 2023,
    "func": [
        {
            "name": "שירותים חברתיים",
            "doc_id": "budget/C2/2023",
            "values": {
                "בריאות": {
                    "amount": 45556773000,
                    "href": "https://next.obudget.org/i/budget/C221/2023",
                    "doc_id": "budget/C221/2023",
                    "explanation": "<p>משרד הבריאות עוסק בתכנון, פיקוח, רישוי ותיאום במערכת הבריאות.</p><p>במסגרת זו המשרד אחראי לקביעת הסטנדרטים המקצועיים בכל תחומי הרפואה ולביצוע פיקוח ובקרה על קופות החולים וגופי בריאות נוספים במסגרת חוק ביטוח בריאות ממלכתי.  המשרד עוסק גם בפיקוח ומפעיל באופן ישיר (כבעלים) מיטות אשפוז בבתי חולים כלליים ובבתי חולים פסיכיאטריים וגריאטריים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "העברות לביטוח הלאומי": {
                    "amount": 57733399000,
                    "href": "https://next.obudget.org/i/budget/C225/2023",
                    "doc_id": "budget/C225/2023",
                    "explanation": "<p>הביטוח הלאומי הוא גוף סטטוטורי (גוף הפועל מכוח חוק) אשר פועל, כמשתמע משמו, כמוסד ביטוחי – תשלום שוטף בעת שגרה מבטיח קבלת ההחזרים במקרה הצורך.</p><p>פרט לקצבאות הביטוחיות שמחלק המוסד לביטוח לאומי, באחריותו גם קצבאות שאינן ביטוחיות, והכספים עבורן מגיעים ישירות מאוצר המדינה. תשלומים אלו ניתנים במקרים בהם המדינה בחרה לתגמל אוכלוסיות מסוימות למרות שלא צברו זכויות ביטוחיות, והביטוח הלאומי אינו אלא צינור להעברת כסף זה.</p>",
                    "explanation_source": "ויקיפדיה"
                },
                "השכלה גבוהה": {
                    "amount": 12593397000,
                    "href": "https://next.obudget.org/i/budget/C223/2023",
                    "doc_id": "budget/C223/2023",
                    "explanation": "<p>מערכת ההשכלה הגבוהה בישראל כוללת מוסדות המוכרים על ידי המועצה להשכלה גבוהה, שהסמיכה אותם להעניק תארים אקדמיים. תקצוב המוסדות נעשה באמצעות הוועדה לתכנון ולתקצוב (ות\"ת) ועל ידי משרד החינוך (התומך בחלק מהמכללות לחינוך). מערכת ההשכלה הגבוהה כוללת גם מוסדות אשר אין בתקציבם השתתפות מתקציב המדינה (מוסדות חוץ-תקציביים).</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "חינוך": {
                    "amount": 79611940000,
                    "href": "https://next.obudget.org/i/budget/C222/2023",
                    "doc_id": "budget/C222/2023",
                    "explanation": "<p>משרד החינוך אחראי להקניית ידע לילדים וזכאים לחינוך בהתאם לחוק לימוד חובה. המשרד אחראי לקידום המצוינות, לשיפור ההישגים ולרמת האיכות החינוכית, תוך צמצום הפערים החברתיים ; ליצירת מערכת חינוך אפקטיבית ויעילה שתשרת את צורכי הפרט ואת צרכיה המשתנים של מדינת ישראל; ולקידום ערכים ציוניים, יהודיים, דמוקרטיים וחברתיים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "מדע, תרבות וספורט": {
                    "amount": 2535972000,
                    "href": "https://next.obudget.org/i/budget/C226/2023",
                    "doc_id": "budget/C226/2023",
                    "explanation": "<p>משרד המדע, הטכנולוגיה והחלל פועל לקביעת מדיניות ולקידום, חיזוק והקמת תשתית בתחום המדע והטכנולוגיה.</p><p>משרד התרבות והספורט פועל לקביעת מדיניות ולקידום, לחיזוק ולהקמת תשתית בשני התחומים העיקריים שבסמכותו: התרבות והספורט.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "קליטת עליה": {
                    "amount": 1957445000,
                    "href": "https://next.obudget.org/i/budget/C227/2023",
                    "doc_id": "budget/C227/2023",
                    "explanation": null,
                    "explanation_source": "צוות מפתח התקציב"
                },
                "רווחה": {
                    "amount": 15232824000,
                    "href": "https://next.obudget.org/i/budget/C224/2023",
                    "doc_id": "budget/C224/2023",
                    "explanation": "<p>משרד הרווחה משמש חולייה מרכזית בהתוויית מדיניות הרווחה בישראל והוא אחראי לקביעת הסטנדרטים של שירותי הרווחה, להערכה ומחקר של השירותים החברתיים ולתקצוב, פיקוח ובקרה של אספקת שירותי הרווחה וברשויות המקומיות, אשר באמצעותן מסופקים מרבית שירותי הרווחה.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "תעסוקה": {
                    "amount": 3900283000,
                    "href": "https://next.obudget.org/i/budget/C228/2023",
                    "doc_id": "budget/C228/2023",
                    "explanation": null,
                    "explanation_source": null
                }
            },
            "amount": 219122033000,
            "percent": 45.199877845121755,
            "scale": 1
        },
        {
            "name": "בטחון וסדר ציבורי",
            "doc_id": "budget/C1/2023",
            "values": {
                "בטחון": {
                    "amount": 63101415000,
                    "href": "https://next.obudget.org/i/budget/C111/2023",
                    "doc_id": "budget/C111/2023",
                    "explanation": "<p>שיעור תקציב הבטחון מהתמ\"ג גבוה בישראל מאשר במדינות אירופה וארה\"ב, אולם הוא נמצא בתוואי יורד בשנים האחרונות, וכך גם האחוז שהוא מהווה מההוצאה הממשלתית.</p><p>באירועים חריגים בעבר נוספו לתקציב המשרד תוספות בגין עלויות לחימה (כמו, למשל, במלחמת לבנון השניה או מבצע \"עופרת יצוקה\").</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "בטחון פנים": {
                    "amount": 22158785000,
                    "href": "https://next.obudget.org/i/budget/C112/2023",
                    "doc_id": "budget/C112/2023",
                    "explanation": "<p>המשרד לביטחון פנים הוא גוף מטה משולב האחראי לאכיפת החוק, לשמירת הסדר הציבורי ולפעילות בתחומים השונים של ביטחון הפנים במדינת ישראל.</p><p>המשרד פועל, בין היתר, באמצעות משטרת ישראל, שירות בתי הסוהר, הרשות הלאומית לכבאות והצלה, הרשות להגנה על עדים, הרשות הלאומית למלחמה בסמים ובאלכוהול וגופים נוספים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "בטחון-אחר": {
                    "amount": 16727742000,
                    "href": "https://next.obudget.org/i/budget/C113/2023",
                    "doc_id": "budget/C113/2023",
                    "explanation": null,
                    "explanation_source": "צוות מפתח התקציב"
                }
            },
            "amount": 101987942000,
            "percent": 21.03778637393056,
            "scale": 0.6822309062948526
        },
        {
            "name": "החזרי חוב",
            "doc_id": "budget/C6/2023",
            "values": {
                "קרן - ביטוח לאומי": {
                    "amount": 17432579000,
                    "href": "https://next.obudget.org/i/budget/C663/2023",
                    "doc_id": "budget/C663/2023",
                    "explanation": "<p>הביטוח הלאומי צבר לאורך השנים עודפים תקציביים גדולים שמטרתם להבטיח את התשלומים העתידיים של הביטוח הלאומי. את העודפים התקציביים מפקיד המוסד במשרד האוצר ומקבל את הכסף בחזרה, בתוספת ריבית, לאחר מספר שנים. סעיף זה מציין את היקף הכספים שממשלת ישראל החזירה לביטוח הלאומי מתוך הקרן שהוא הפקיד בידיה.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "ריבית": {
                    "amount": 43667499000,
                    "href": "https://next.obudget.org/i/budget/C661/2023",
                    "doc_id": "budget/C661/2023",
                    "explanation": "<p>אלו תשלומי הריבית השוטפים שממשלת ישראל משלמת כל שנה על החוב שלה. סעיף זה כולל את התשלום על מלוות הפנים (חוב שנלקח מאזרחי מדינת ישראל) ומלוות החוץ (חוב שנלקח מאזרחי העולם).</p>",
                    "explanation_source": "צוות מפתח התקציב"
                }
            },
            "amount": 61100078000,
            "percent": 12.603552568935006,
            "scale": 0.5280534179252679
        },
        {
            "name": "תשתיות",
            "doc_id": "budget/C3/2023",
            "values": {
                "אנרגיה": {
                    "amount": 585823000,
                    "href": "https://next.obudget.org/i/budget/C333/2023",
                    "doc_id": "budget/C333/2023",
                    "explanation": "<p>משרד התשתיות הלאומיות, האנרגיה והמים מופקד, בין היתר, על תכנונה ועל ביצועה של המדיניות הלאומית בתחום האנרגיה, המים ותשתית משאבי הטבע במדינת ישראל.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "בינוי ושיכון": {
                    "amount": 5992623000,
                    "href": "https://next.obudget.org/i/budget/C334/2023",
                    "doc_id": "budget/C334/2023",
                    "explanation": "<p>משרד הבינוי והשיכון פועל בשני מישורים בתחום הדיור: ליצור תנאים להרחבת היצע הדיור בדרך שתאפשר מתן מענה לביקוש, סיוע בדיור מכּוון לתמיכה בזכאים מקרב אוכלוסיות חלשות.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "משק המים": {
                    "amount": 719863000,
                    "href": "https://next.obudget.org/i/budget/C332/2023",
                    "doc_id": "budget/C332/2023",
                    "explanation": "<p>הרשות הממשלתית למיום ולביוב אמונה על ניהול משק המים, ובכלל זה על קביעת כללים לאסדרת המשק וכן על הקצאת המשאבים בתחום. מדיניות משק המים נתונה בידי מועצה (מועצת רשות המים) המורכבת מנציגי משרדי ממשלה בכירים ומנציגי הציבור. בסמכות מועצת רשות המים לקבוע את חקיקת המשנה לפעילות הרשות בנושאים רבים, ביניהם אסדרת משק המים וקביעת תעריפים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "תחבורה": {
                    "amount": 33838493000,
                    "href": "https://next.obudget.org/i/budget/C331/2023",
                    "doc_id": "budget/C331/2023",
                    "explanation": "<p>משרד התחבורה אחראי לפיתוח ולהסדרה של מערכות התחבורה היבשתית, האווירית והימית בישראל.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                }
            },
            "amount": 41136802000,
            "percent": 8.48558403681368,
            "scale": 0.43328358781199794
        },
        {
            "name": "הוצאות אחרות",
            "doc_id": "budget/C7/2023",
            "values": {
                "גמלאות": {
                    "amount": 21824107000,
                    "href": "https://next.obudget.org/i/budget/C771/2023",
                    "doc_id": "budget/C771/2023",
                    "explanation": "<p>החבות האקטוארית החשבונאית של המדינה בגין הגמלאים ועובדי המדינה הפעילים, לרבות משרתי הקבע, שוטרים, סוהרים ועובדי הוראה.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "הוצאות שונות": {
                    "amount": 8156868000,
                    "href": "https://next.obudget.org/i/budget/C772/2023",
                    "doc_id": "budget/C772/2023",
                    "explanation": "<p>סעיף סל שמרכז הוצאות שונות של הממשלה על מגוון נושאים. בין שאר הנושאים אפשר לציין השקעה בפרויקטי מחשוב רוחביים,  מימון תכניות הבראה לגופים ציבוריים, תקציבים לרשויות הפיקוח ממשלתיות עצמאיות ועוד.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "רזרבה": {
                    "amount": 0,
                    "href": "https://next.obudget.org/i/budget/C773/2023",
                    "doc_id": "budget/C773/2023",
                    "explanation": "<p>על ידי סעיף זה הממשלה שומרת לעצמה כסף בצד להוצאות לא צפויות. שימו לב שבשנים של תקציב דו שנתי נשמרת רזרבה גם למקרה שהתחזיות הכלכליות, שנעשו שנתיים מראש, יתגלו כלא מדויקות.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                }
            },
            "amount": 29980975000,
            "percent": 6.184391360031099,
            "scale": 0.3698961847196491
        },
        {
            "name": "משרדי מטה",
            "doc_id": "budget/C4/2023",
            "values": {
                "אוצר": {
                    "amount": 5028966000,
                    "href": "https://next.obudget.org/i/budget/C442/2023",
                    "doc_id": "budget/C442/2023",
                    "explanation": "<p>משרד האוצר נחלק למשרד הראשי ולרשות המסים בישראל.</p><p>היחידות העיקריות של המשרד הראשי הן</p><p>1. אגף התקציבים, שמכין את תקציב המדינה ומפקח עליו;</p><p>2. האגף לשכר ולהסכמי עבודה, המבצע הסכמי עבודה במשק;</p><p>3. אגף הכלכלן הראשי.</p><p>רשות המסים אחראית לגביית המסים הישירים והעקיפים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "חוץ": {
                    "amount": 1760609000,
                    "href": "https://next.obudget.org/i/budget/C444/2023",
                    "doc_id": "budget/C444/2023",
                    "explanation": "<p>משרד החוץ מופקד על גיבוש מדיניות החוץ של ממשלת ישראל ועל ביצועה בקרב מדינות המקיימות יחסים דיפלומטיים עם מדינת ישראל.  המשרד מטפל גם בשמירת זכויותיהם של האזרחים הישראלים השוהים בחו\"ל ומסייע להם באמצעות נציגויותיו בחו\"ל.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "משפטים": {
                    "amount": 4448103000,
                    "href": "https://next.obudget.org/i/budget/C443/2023",
                    "doc_id": "budget/C443/2023",
                    "explanation": "<p>משרד המשפטים אחראי על מספר גדול של יחידות, ביניהן: הנהלת בתי המשפט, האגך לרישום והסדר מקרקעין, פרקליטות המדינה, הסנגוריה הציבורית, האפוטרופוס הכללי, רשות האכיפה והגבייה (המורכבת מההוצאה לפועל ומהמרכז לגביית קנסות), בתי דין שונים ויחידות וגופים נוספים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "משרדים נוספים": {
                    "amount": 1657771000,
                    "href": "https://next.obudget.org/i/budget/C446/2023",
                    "doc_id": "budget/C446/2023",
                    "explanation": null,
                    "explanation_source": null
                },
                "פנים ושלטון מקומי": {
                    "amount": 8243727000,
                    "href": "https://next.obudget.org/i/budget/C445/2023",
                    "doc_id": "budget/C445/2023",
                    "explanation": "<p>משרד הפנים אחראי מטעם הממשלה לנושאים הבאים:</p><li>פיקוח על הרשויות המקומיות והכוונת פעולותיהן.</li><li>ארגון וניהול הבחירות לרשויות המקומיות.</li><li>פיקוח על אתרי הרחצה ועל רישוי עסקים.</li><li>היערכות לשעת חירום ברשויות המקומיות.</li><li>מתן שירותי דת וסיוע בשיפוץ ובפיתוח של מבני דת לעדות הלא יהודיות.</li><li>שמירה על המאגר הביומטרי.</li>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "ראש הממשלה": {
                    "amount": 3644468000,
                    "href": "https://next.obudget.org/i/budget/C441/2023",
                    "doc_id": "budget/C441/2023",
                    "explanation": "<p>משרד ראש הממשלה כולל את היחידות הגופים והתחומים הכפופים ישירות לאחריות ראש הממשלה ויחידות וגופים עצמאיים בקביעת תכניות העבודה שלהם וניהול התקציב.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "שירותי דת": {
                    "amount": 793493000,
                    "href": "https://next.obudget.org/i/budget/C447/2023",
                    "doc_id": "budget/C447/2023",
                    "explanation": "<p>עד לשנת 2016 המשרד לשירותי דת היה מתוקצב כחלק מתקציב משרד ראש הממשלה. החל משנה זו המשרד מתוקצב בסעיף תקציבי נפרד, הכולל את המשרד ואת יחידות הסמך הכפופות לו: הרבנות הראשית ובתי הדין הרבניים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                }
            },
            "amount": 25577137000,
            "percent": 5.275980019900345,
            "scale": 0.3416511922046017
        },
        {
            "name": "ענפי משק",
            "doc_id": "budget/C5/2023",
            "values": {
                "הגנת הסביבה": {
                    "amount": 384025000,
                    "href": "https://next.obudget.org/i/budget/C554/2023",
                    "doc_id": "budget/C554/2023",
                    "explanation": "<p>המשרד להגנת הסביבה פועל להתוויה של מדיניות סביבתית וכן מקדם הליכי תקינה בתחום.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "חקלאות": {
                    "amount": 2209247000,
                    "href": "https://next.obudget.org/i/budget/C552/2023",
                    "doc_id": "budget/C552/2023",
                    "explanation": "<p>משרד החקלאות ופיתוח הכפר אחראי מטעם הממשלה לחקלאות ולמרחב הכפרי בישראל.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "כלכלה ותעשיה": {
                    "amount": 2770985000,
                    "href": "https://next.obudget.org/i/budget/C553/2023",
                    "doc_id": "budget/C553/2023",
                    "explanation": "<p>משרד הכלכלה והתעשייה מופקד על עידוד ענפי התעשייה והמסחר, לרבות עסקים קטנים ובינוניים וקידום סחר החוץ וכן על יישום מדיניות הממשלה להפחתת יוקר המחיה ולהגברת התחרות במשק.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                },
                "תיירות": {
                    "amount": 422478000,
                    "href": "https://next.obudget.org/i/budget/C551/2023",
                    "doc_id": "budget/C551/2023",
                    "explanation": "<p>משרד התיירות ממונה על קידום ושיווק תנועת התיירות לישראל, מקיים פיקוח על שירותי התיירות: בתי מלון, אכסניות ובתי הארחה ואחראי על הכשרת כוח האדם ועל רישוי פרטים וגופים מסחריים העוסקים בענף. כמו כן הוא מרכז את איסוף ופרסום הנתונים הסטטיסטיים בחקר תנועת התיירות אל ישראל ובתוכה, לצורך לימוד והסקת מסקנות אסטרטגיות, וזאת בראיית התיירות כענף כלכלי מרכזי במדינת ישראל וכמקור הכנסה חשוב של מטבע חוץ.</p>",
                    "explanation_source": "ויקיפדיה"
                },
                "תקשורת": {
                    "amount": 92867000,
                    "href": "https://next.obudget.org/i/budget/C555/2023",
                    "doc_id": "budget/C555/2023",
                    "explanation": "<p>משרד התקשורת משמש גוף האחראי לאסדרת ענף תקשורת ולפיקוח על הגופים הפועלים בו. המשרד אחראי ליישום מדיניות הממשלה בנושא התקשורת ולקביעת הכללים שבמסגרתם פועלים הגופים בענף, על תחומיו השונים.</p>",
                    "explanation_source": "צוות מפתח התקציב"
                }
            },
            "amount": 5879602000,
            "percent": 1.212827795267551,
            "scale": 0.1638064280261841
        }
    ],
    "econ": [
        {
            "name": "העברות",
            "doc_id": "budget/C003/2023",
            "values": {
                "מוצרים ציבוריים": {
                    "amount": 60229317000,
                    "href": "https://next.obudget.org/i/budget/E003031/2023"
                },
                "סובסידיה": {
                    "amount": 14379398000,
                    "href": "https://next.obudget.org/i/budget/E003038/2023"
                },
                "רזרבה": {
                    "amount": 9183991000,
                    "href": "https://next.obudget.org/i/budget/E003036/2023"
                },
                "שכר עקיף": {
                    "amount": 35965267000,
                    "href": "https://next.obudget.org/i/budget/E003029/2023"
                },
                "תמיכות לפי סעיף 3א": {
                    "amount": 3335425000,
                    "href": "https://next.obudget.org/i/budget/E003035/2023"
                },
                "תשלומי העברה סוציאליים": {
                    "amount": 80617409000,
                    "href": "https://next.obudget.org/i/budget/E003034/2023"
                }
            },
            "amount": 203710807000,
            "percent": 42.01697975926905,
            "scale": 1
        },
        {
            "name": "שכר",
            "doc_id": "budget/C001/2023",
            "values": {
                "רזרבה": {
                    "amount": 5168702000,
                    "href": "https://next.obudget.org/i/budget/E001104/2023"
                },
                "שכר בארץ": {
                    "amount": 102864881000,
                    "href": "https://next.obudget.org/i/budget/E001030/2023"
                },
                "שכר בחו\"ל": {
                    "amount": 922354000,
                    "href": "https://next.obudget.org/i/budget/E001185/2023"
                }
            },
            "amount": 108955937000,
            "percent": 22.473031583352345,
            "scale": 0.7313384640522157
        },
        {
            "name": "קניות",
            "doc_id": "budget/C002/2023",
            "values": {
                "קניות בארץ": {
                    "amount": 65891596000,
                    "href": "https://next.obudget.org/i/budget/E002033/2023"
                },
                "קניות בחו\"ל": {
                    "amount": 1995851000,
                    "href": "https://next.obudget.org/i/budget/E002198/2023"
                },
                "רזרבה": {
                    "amount": 9466837000,
                    "href": "https://next.obudget.org/i/budget/E002173/2023"
                }
            },
            "amount": 77354284000,
            "percent": 15.95493843937671,
            "scale": 0.6162190933773976
        },
        {
            "name": "החזר חוב - ריבית",
            "doc_id": "budget/C015/2023",
            "values": {
                "החזר ריבית בארץ": {
                    "amount": 36966935000,
                    "href": "https://next.obudget.org/i/budget/E015209/2023"
                },
                "החזר ריבית בחו\"ל": {
                    "amount": 6700564000,
                    "href": "https://next.obudget.org/i/budget/E015210/2023"
                }
            },
            "amount": 43667499000,
            "percent": 9.006770178966997,
            "scale": 0.46299054792285865
        },
        {
            "name": "השקעה",
            "doc_id": "budget/C007/2023",
            "values": {
                "השקעה בארץ": {
                    "amount": 28069987000,
                    "href": "https://next.obudget.org/i/budget/E007047/2023"
                },
                "השקעה בחו\"ל": {
                    "amount": 252679000,
                    "href": "https://next.obudget.org/i/budget/E007048/2023"
                },
                "רזרבה": {
                    "amount": 4658180000,
                    "href": "https://next.obudget.org/i/budget/E007044/2023"
                }
            },
            "amount": 32980846000,
            "percent": 6.802562707562047,
            "scale": 0.4023683954917741
        },
        {
            "name": "אחרים",
            "values": {
                "החזר קרן ביטוח לאומי": {
                    "amount": 17432579000,
                    "href": "https://next.obudget.org/i/budget/E017266/2023"
                }
            },
            "amount": 17432579000,
            "percent": 3.5956085481260636
        }
    ],
    "income": [
        {
            "name": "מס הכנסה",
            "values": {
                "מס הכנסה סקטור עסקי": {
                    "amount": 109297000000,
                    "href": "https://next.obudget.org/i/budget/00000103/2023"
                },
                "מס הכנסה שכירים": {
                    "amount": 58000000000,
                    "href": "https://next.obudget.org/i/budget/00000102/2023"
                }
            },
            "amount": 167297000000,
            "percent": 42.15591163478668,
            "scale": 1
        },
        {
            "name": "תקבולי מע\"מ ברוטו",
            "values": {
                "תקבולי מע\"מ נטו": {
                    "amount": 120383000000,
                    "href": "https://next.obudget.org/i/budget/00001402/2023"
                }
            },
            "amount": 120383000000,
            "percent": 30.334405938722902,
            "scale": 0.84827858716616
        },
        {
            "name": "מס קניה",
            "values": {
                "מס קניה מוצרי יבוא": {
                    "amount": 20400000000,
                    "href": "https://next.obudget.org/i/budget/00001302/2023"
                },
                "מס קניה מקומי": {
                    "amount": 1800000000,
                    "href": "https://next.obudget.org/i/budget/00001303/2023"
                }
            },
            "amount": 22200000000,
            "percent": 5.594010880603145,
            "scale": 0.36427755304296205
        },
        {
            "name": "מיסים על הוצאות שכר",
            "values": {
                "מע\"מ על מלכרים": {
                    "amount": 14000000000,
                    "href": "https://next.obudget.org/i/budget/00000202/2023"
                },
                "מע\"מ על פיננסים": {
                    "amount": 3305000000,
                    "href": "https://next.obudget.org/i/budget/00000203/2023"
                }
            },
            "amount": 17305000000,
            "percent": 4.360556679677361,
            "scale": 0.3216190207050562
        },
        {
            "name": "אחרים",
            "values": {
                "מלוה מהמוסד לבטוח לאומי": {
                    "amount": 19187000000,
                    "href": "https://next.obudget.org/i/budget/00008101/2023"
                },
                "מס דלק": {
                    "amount": 18690000000,
                    "href": "https://next.obudget.org/i/budget/00001801/2023"
                },
                "מס רכישה": {
                    "amount": 9205000000,
                    "href": "https://next.obudget.org/i/budget/00000401/2023"
                },
                "מס שבח": {
                    "amount": 6883000000,
                    "href": "https://next.obudget.org/i/budget/00000301/2023"
                },
                "אגרות כלי רכב פרטיים": {
                    "amount": 5200000000,
                    "href": "https://next.obudget.org/i/budget/00002402/2023"
                },
                "מכס והיטל על היבוא": {
                    "amount": 2800000000,
                    "href": "https://next.obudget.org/i/budget/00001101/2023"
                }
            },
            "amount": 61965000000,
            "percent": 15.614093883629454
        }
    ],
    "deficitChart": {
        "budget": 484784569000,
        "expenseChildren": [
            {
                "code": "0001",
                "net_allocated": 64256000,
                "net_revised": 64256000,
                "title": "נשיא המדינה ולשכתו"
            },
            {
                "code": "0002",
                "net_allocated": 1033116000,
                "net_revised": 1033116000,
                "title": "הכנסת"
            },
            {
                "code": "0004",
                "net_allocated": 3712971000,
                "net_revised": 3712971000,
                "title": "משרד ראש הממשלה"
            },
            {
                "code": "0005",
                "net_allocated": 3583550000,
                "net_revised": 3583550000,
                "title": "משרד האוצר"
            },
            {
                "code": "0006",
                "net_allocated": 470028000,
                "net_revised": 470028000,
                "title": "משרד הפנים"
            },
            {
                "code": "0007",
                "net_allocated": 23015682000,
                "net_revised": 23015682000,
                "title": "המשרד לביטחון הפנים"
            },
            {
                "code": "0008",
                "net_allocated": 4828041000,
                "net_revised": 4828041000,
                "title": "משרד המשפטים"
            },
            {
                "code": "0009",
                "net_allocated": 1859041000,
                "net_revised": 1859041000,
                "title": "משרד החוץ"
            },
            {
                "code": "0010",
                "net_allocated": 51510000,
                "net_revised": 51510000,
                "title": "מטה לביטחון לאומי"
            },
            {
                "code": "0011",
                "net_allocated": 421068000,
                "net_revised": 421068000,
                "title": "מבקר המדינה"
            },
            {
                "code": "0012",
                "net_allocated": 23056988000,
                "net_revised": 23056988000,
                "title": "גמלאות ופיצויים"
            },
            {
                "code": "0013",
                "net_allocated": 3447549000,
                "net_revised": 3447549000,
                "title": "הוצאות שונות"
            },
            {
                "code": "0014",
                "net_allocated": 212693000,
                "net_revised": 212693000,
                "title": "בחירות ומימון מפלגות"
            },
            {
                "code": "0015",
                "net_allocated": 64448592000,
                "net_revised": 64448592000,
                "title": "משרד הביטחון"
            },
            {
                "code": "0016",
                "net_allocated": 548301000,
                "net_revised": 548301000,
                "title": "הוצאות חירום אזרחיות"
            },
            {
                "code": "0017",
                "net_allocated": 137750000,
                "net_revised": 137750000,
                "title": "תאום הפעולות בשטחים"
            },
            {
                "code": "0018",
                "net_allocated": 6775857000,
                "net_revised": 6775857000,
                "title": "הרשויות המקומיות"
            },
            {
                "code": "0019",
                "net_allocated": 2749765000,
                "net_revised": 2749765000,
                "title": "מדע, תרבות וספורט"
            },
            {
                "code": "0020",
                "net_allocated": 82937392000,
                "net_revised": 82937392000,
                "title": "משרד החינוך"
            },
            {
                "code": "0021",
                "net_allocated": 13475990000,
                "net_revised": 13475990000,
                "title": "ההשכלה הגבוהה"
            },
            {
                "code": "0022",
                "net_allocated": 798846000,
                "net_revised": 798846000,
                "title": "המשרד לשירותי דת"
            },
            {
                "code": "0023",
                "net_allocated": 10836310000,
                "net_revised": 10836310000,
                "title": "משרד הרווחה"
            },
            {
                "code": "0024",
                "net_allocated": 50539488000,
                "net_revised": 50539488000,
                "title": "משרד הבריאות"
            },
            {
                "code": "0025",
                "net_allocated": 5130623000,
                "net_revised": 5130623000,
                "title": "הרשות לניצולי השואה"
            },
            {
                "code": "0026",
                "net_allocated": 395475000,
                "net_revised": 395475000,
                "title": "המשרד להגנת הסביבה"
            },
            {
                "code": "0027",
                "net_allocated": 61446529000,
                "net_revised": 61446529000,
                "title": "הקצבות לביטוח לאומי"
            },
            {
                "code": "0029",
                "net_allocated": 313995000,
                "net_revised": 313995000,
                "title": "משרד הבינוי והשיכון"
            },
            {
                "code": "0030",
                "net_allocated": 1747346000,
                "net_revised": 1747346000,
                "title": "משרד העלייה והקליטה"
            },
            {
                "code": "0031",
                "net_allocated": 14081197000,
                "net_revised": 14081197000,
                "title": "הוצאות ביטחוניות שונות"
            },
            {
                "code": "0033",
                "net_allocated": 2230003000,
                "net_revised": 2230003000,
                "title": "משרד החקלאות"
            },
            {
                "code": "0034",
                "net_allocated": 644687000,
                "net_revised": 644687000,
                "title": "משרד האנרגיה"
            },
            {
                "code": "0035",
                "net_allocated": 147927000,
                "net_revised": 147927000,
                "title": "הועדה לאנרגיה אטומית"
            },
            {
                "code": "0036",
                "net_allocated": 4141977000,
                "net_revised": 4141977000,
                "title": "תעסוקה"
            },
            {
                "code": "0037",
                "net_allocated": 191090000,
                "net_revised": 191090000,
                "title": "משרד התיירות"
            },
            {
                "code": "0038",
                "net_allocated": 2894654000,
                "net_revised": 2894654000,
                "title": "כלכלה ותעשייה"
            },
            {
                "code": "0039",
                "net_allocated": 90873000,
                "net_revised": 90873000,
                "title": "משרד התקשורת"
            },
            {
                "code": "0040",
                "net_allocated": 556998000,
                "net_revised": 556998000,
                "title": "משרד התחבורה"
            },
            {
                "code": "0041",
                "net_allocated": 113887000,
                "net_revised": 113887000,
                "title": "רשות ממשלתית למים וביוב"
            },
            {
                "code": "0042",
                "net_allocated": 3442343000,
                "net_revised": 3442343000,
                "title": "מענקי בינוי ושיכון"
            },
            {
                "code": "0043",
                "net_allocated": 119639000,
                "net_revised": 119639000,
                "title": "המרכז למיפוי ישראל"
            },
            {
                "code": "0045",
                "net_allocated": 44547806000,
                "net_revised": 44547806000,
                "title": "תשלום ריבית ועמלות"
            },
            {
                "code": "0046",
                "net_allocated": 2449690000,
                "net_revised": 2449690000,
                "title": "חוק חיילים משוחררים"
            },
            {
                "code": "0047",
                "net_allocated": 2054955000,
                "net_revised": 2054955000,
                "title": "רזרבה כללית"
            },
            {
                "code": "0051",
                "net_allocated": 1633752000,
                "net_revised": 1633752000,
                "title": "דיור ממשלתי"
            },
            {
                "code": "0052",
                "net_allocated": 291169000,
                "net_revised": 291169000,
                "title": "המשטרה ובתי הסוהר"
            },
            {
                "code": "0054",
                "net_allocated": 2424381000,
                "net_revised": 2424381000,
                "title": "רשויות פיקוח"
            },
            {
                "code": "0060",
                "net_allocated": 1888837000,
                "net_revised": 1888837000,
                "title": "חינוך"
            },
            {
                "code": "0067",
                "net_allocated": 858452000,
                "net_revised": 858452000,
                "title": "בריאות"
            },
            {
                "code": "0068",
                "net_allocated": 790039000,
                "net_revised": 790039000,
                "title": "רשות האוכלוסין"
            },
            {
                "code": "0070",
                "net_allocated": 2024385000,
                "net_revised": 2024385000,
                "title": "שיכון"
            },
            {
                "code": "0073",
                "net_allocated": 526593000,
                "net_revised": 526593000,
                "title": "מפעלי מים"
            },
            {
                "code": "0076",
                "net_allocated": 44069000,
                "net_revised": 44069000,
                "title": "תעשייה"
            },
            {
                "code": "0078",
                "net_allocated": 262747000,
                "net_revised": 262747000,
                "title": "תיירות"
            },
            {
                "code": "0079",
                "net_allocated": 35951404000,
                "net_revised": 35951404000,
                "title": "תחבורה"
            },
            {
                "code": "0083",
                "net_allocated": 2999174000,
                "net_revised": 2999174000,
                "title": "הוצאות פיתוח אחרות"
            },
            {
                "code": "0084",
                "net_allocated": 158247615000,
                "net_revised": 158247615000,
                "title": "תשלום חובות"
            },
            {
                "code": "0089",
                "net_allocated": 1386534000,
                "net_revised": 1386534000,
                "title": "מפעלי משרד ראש הממשלה"
            },
            {
                "code": "0093",
                "net_allocated": 2898152000,
                "net_revised": 2898152000,
                "title": "בתי חולים לבריאות הנפש"
            },
            {
                "code": "0094",
                "net_allocated": 24851158000,
                "net_revised": 24851158000,
                "title": "בתי חולים ממשלתים"
            },
            {
                "code": "0095",
                "net_allocated": 63988000,
                "net_revised": 63988000,
                "title": "נמל חדרה"
            },
            {
                "code": "0098",
                "net_allocated": 39752916000,
                "net_revised": 39752916000,
                "title": "הוצאות מינהל מקרקעי"
            }
        ],
        "income": 396853000000,
        "returns": 125961133000,
        "deficitFunding": 143571852000,
        "incomeChildren": [
            {
                "net_allocated": 201390000000,
                "title": "מסים ישירים"
            },
            {
                "net_allocated": 164073000000,
                "title": "מסים עקיפים"
            },
            {
                "net_allocated": 24420000000,
                "title": "הכנסות אחרות"
            },
            {
                "net_allocated": 6970000000,
                "title": "אגרות"
            }
        ]
    },
    "educationCharts": [
        {
            "__created_at": "2023-03-23T19:25:54Z",
            "__date_range_from": "2024-01-01",
            "__date_range_months": [
                "2024-01",
                "2024-02",
                "2024-03",
                "2024-04",
                "2024-05",
                "2024-06",
                "2024-07",
                "2024-08",
                "2024-09",
                "2024-10",
                "2024-11",
                "2024-12"
            ],
            "__date_range_to": "2024-12-31",
            "__hash": "ab436470503b80d5ac999798c94757d6",
            "__is_new": false,
            "__is_stale": true,
            "__last_modified_at": "2023-10-01T12:30:58Z",
            "__last_updated_at": "2023-10-01T12:30:58Z",
            "__next_update_days": 1,
            "__revision": 278,
            "__staleness": 133333,
            "admin_cls_code_0": [
                "1"
            ],
            "amounts_allocated": 7280556,
            "amounts_executed": null,
            "amounts_revised": 7280556,
            "charts": [
                {
                    "chart": {
                        "centerHeight": 75,
                        "centerTitle": "משרד החינוך",
                        "centerWidth": 200,
                        "directionLeft": true,
                        "groups": [
                            {
                                "class": "budget-expense",
                                "flows": [
                                    {
                                        "context": "budget/002068/2024",
                                        "label": "‹ (…68) מינהל עובדי הוראה",
                                        "size": 1705588000
                                    },
                                    {
                                        "context": "budget/002060/2024",
                                        "label": "‹ (…60) יחידות מטה",
                                        "size": 1854004000
                                    },
                                    {
                                        "context": "budget/002069/2024",
                                        "label": "‹ (…69) תמיכה בנושאי יהדות",
                                        "size": 2008325000
                                    },
                                    {
                                        "context": "budget/002065/2024",
                                        "label": "‹ (…65) שירותי עזר, הסעות",
                                        "size": 4310107000
                                    },
                                    {
                                        "context": "budget/002066/2024",
                                        "label": "‹ (…66) חינוך התיישבותי",
                                        "size": 4586786000
                                    },
                                    {
                                        "context": "budget/002067/2024",
                                        "label": "‹ (…67) פעולות משלימות לקידום",
                                        "size": 5149915000
                                    },
                                    {
                                        "context": "budget/002070/2024",
                                        "label": "‹ (…70) רזרבות",
                                        "size": 5454510000
                                    },
                                    {
                                        "context": "budget/002062/2024",
                                        "label": "‹ (…62) קדם יסודי",
                                        "size": 8326090000
                                    },
                                    {
                                        "context": "budget/002064/2024",
                                        "label": "‹ (…64) חטיבה עליונה",
                                        "size": 13311138000
                                    },
                                    {
                                        "context": "budget/002061/2024",
                                        "label": "‹ (…61) חינוך מיוחד",
                                        "size": 13705668000
                                    },
                                    {
                                        "context": "budget/002063/2024",
                                        "label": "‹ (…63) יסודי וחטיבות ביניים",
                                        "size": 22525261000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": true,
                                "offset": 100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            }
                        ],
                        "height": "730px",
                        "type": "mushonkey",
                        "width": "100%"
                    },
                    "description": null,
                    "long_title": "מהם תתי הסעיפים של סעיף זה?",
                    "title": "מבנה התקציב",
                    "type": "mushonkey"
                },
                {
                    "long_title": "איך התקציב בסעיף זה השתנה לאורך השנים?",
                    "subcharts": [
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        17998587000,
                                        19588376000,
                                        20085909000,
                                        20983486000,
                                        22339703000,
                                        23870824000,
                                        24627762000,
                                        24685348000,
                                        24531094000,
                                        25653928000,
                                        25877676000,
                                        27551845000,
                                        30311997000,
                                        32418924000,
                                        34901335000,
                                        36278439000,
                                        42425121000,
                                        43595011000,
                                        48859772000,
                                        50861316000,
                                        53805091000,
                                        56174410000,
                                        60456672000,
                                        null,
                                        67636134000,
                                        67812808000,
                                        77776056000,
                                        82937392000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        18079238000,
                                        19835506000,
                                        20643414000,
                                        21293620000,
                                        23535607000,
                                        24294205000,
                                        24921004000,
                                        25537640000,
                                        25506872000,
                                        26085676000,
                                        28881929000,
                                        29609863000,
                                        31267196000,
                                        34651668000,
                                        37534630000,
                                        40703672000,
                                        44624799000,
                                        46736612000,
                                        50554428000,
                                        53547520000,
                                        58390972000,
                                        61264312000,
                                        64125147000,
                                        68999783000,
                                        71759037000,
                                        74618184000,
                                        77776056000,
                                        82937392000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        17176380244,
                                        18516602605,
                                        20236285667,
                                        20908315183,
                                        23167327423,
                                        23289189728,
                                        23638772131,
                                        24685907411,
                                        24483145749,
                                        25098523160,
                                        27106375236,
                                        28621630029,
                                        30040732590,
                                        33207557192,
                                        35784375204,
                                        39338053598,
                                        42448260452,
                                        44709492453,
                                        47866175202,
                                        50709517534,
                                        55401746028,
                                        57918750207,
                                        60947384862,
                                        64030668117,
                                        66380500348,
                                        null,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "תקציב ב-₪"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)",
                            "title": "נומינלית",
                            "type": "plotly"
                        },
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        11.160354529796015,
                                        11.238039001442868,
                                        10.911516743063837,
                                        10.713816360638303,
                                        10.864005412272409,
                                        10.969987650757043,
                                        10.87383072682587,
                                        11.005371472885011,
                                        10.604639414051023,
                                        10.872715214588178,
                                        10.540927987130505,
                                        10.88931124379012,
                                        11.337895178350884,
                                        11.714754444941986,
                                        11.93155213104771,
                                        11.793183124625319,
                                        12.94463196537599,
                                        12.865361796163295,
                                        13.810455615162143,
                                        13.590629700483312,
                                        13.963907446563061,
                                        13.955089934835293,
                                        14.250538987480617,
                                        null,
                                        12.913400620871085,
                                        13.451893571089116,
                                        15.948085230602214,
                                        16.053320595775848
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        11.210363664023195,
                                        11.379819850372181,
                                        11.214377078727102,
                                        10.872165584556111,
                                        11.445584653883554,
                                        11.164555058298784,
                                        11.003305092787173,
                                        11.385345458399337,
                                        11.026462176548444,
                                        11.055699787105416,
                                        11.764670587823117,
                                        11.702701365116747,
                                        11.69517768060455,
                                        12.521568628485449,
                                        12.83178407257451,
                                        13.231712029855643,
                                        13.61579144544758,
                                        13.792482412882222,
                                        14.289458494483155,
                                        14.308409080473343,
                                        15.154070248163974,
                                        15.219545407878945,
                                        15.115253241220849,
                                        13.287852952289818,
                                        13.700564153310584,
                                        14.801862645710596,
                                        15.948085230602214,
                                        16.053320595775848
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        10.650530125593981,
                                        10.623152335303784,
                                        10.993207719545738,
                                        10.675435401010471,
                                        11.266486869201394,
                                        10.702693954439855,
                                        10.437164641371101,
                                        11.005620872887839,
                                        10.583911683262116,
                                        10.63732207502203,
                                        11.04142231917633,
                                        11.312122207800988,
                                        11.236431475837414,
                                        11.999731336568951,
                                        12.233432853599927,
                                        12.787784773417068,
                                        12.951692208999583,
                                        13.19425739176158,
                                        13.52961057810085,
                                        13.550067699678861,
                                        14.378283532927854,
                                        14.388426474829824,
                                        14.36620732548621,
                                        12.330909828739141,
                                        12.673669290554018,
                                        null,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "אחוזים"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים כאחוז מכלל התקציב",
                            "title": "באחוזים מכלל התקציב",
                            "type": "plotly"
                        },
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020
                                    ],
                                    "y": [
                                        4547041.702424799,
                                        4443742.29965375,
                                        4141145.3289644183,
                                        3885390.3964958047,
                                        4060482.5458727935,
                                        4158849.681328472,
                                        4256568.769363055,
                                        4062561.7460359517,
                                        3831778.223505638,
                                        3735057.9427713673,
                                        3515918.364130499,
                                        3543369.4814269138,
                                        3706823.517787117,
                                        3695020.105588533,
                                        3718758.693864208,
                                        3640817.9547818652,
                                        3994204.019311086,
                                        3918518.1236922923,
                                        4189102.418459161,
                                        4151146.4654057496,
                                        4207332.671327606,
                                        4187180.526137524,
                                        4262168.081075609,
                                        null
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020
                                    ],
                                    "y": [
                                        4567416.827446683,
                                        4499805.2440506425,
                                        4256087.063820645,
                                        3942816.110470443,
                                        4277851.027384811,
                                        4232612.444479444,
                                        4307251.601975517,
                                        4202826.686828055,
                                        3984195.595978952,
                                        3797917.8602341297,
                                        3924096.760567418,
                                        3808045.700875276,
                                        3823633.839369253,
                                        3949502.147331564,
                                        3999337.8944810084,
                                        4084923.8260541437,
                                        4201297.422976103,
                                        4200899.528663375,
                                        4334397.561221111,
                                        4370386.294747932,
                                        4565929.350554866,
                                        4566576.385112249,
                                        4520793.912335785,
                                        4923609.810830034
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018,
                                        2019,
                                        2020
                                    ],
                                    "y": [
                                        4339324.929572163,
                                        4200603.982776179,
                                        4172148.7369820634,
                                        3871471.452309479,
                                        4210912.23261167,
                                        4057515.537741434,
                                        4085635.5197400544,
                                        4062653.810435,
                                        3824288.664987091,
                                        3654194.3315888746,
                                        3682857.8608552245,
                                        3680951.687752697,
                                        3673650.866888311,
                                        3784906.3553719763,
                                        3812847.1702980357,
                                        3947873.60739997,
                                        3996382.532654231,
                                        4018692.792121655,
                                        4103914.162781769,
                                        4138757.1346697947,
                                        4332184.404486907,
                                        4317201.78218114,
                                        4296763.116300004,
                                        4569029.234988509
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "אחוזים"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים כאחוז מהתוצר הלאומי הגולמי",
                            "title": "לעומת התוצר המקומי הגולמי",
                            "type": "plotly"
                        },
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018
                                    ],
                                    "y": [
                                        26487337076.5256,
                                        27341201538.746296,
                                        26651507994.42712,
                                        27532264560.28375,
                                        28988444260.562584,
                                        29308833888.7526,
                                        30036298074.235153,
                                        30231584016.727802,
                                        29649305333.131893,
                                        30365966916.225254,
                                        30473005181.34715,
                                        31019574988.263622,
                                        33032198550.64567,
                                        34401298846.00079,
                                        35800218826.50892,
                                        36588526764.327675,
                                        42144159919.81982,
                                        43101853940.134346,
                                        48613866872.939,
                                        50882941250.031265,
                                        53697695608.78243,
                                        55613639157.03775
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018
                                    ],
                                    "y": [
                                        26606025850.40318,
                                        27686142392.25403,
                                        27391247926.75645,
                                        27939188907.226818,
                                        30540273147.678223,
                                        29828665269.54842,
                                        30393939345.897793,
                                        31275366636.473934,
                                        30828671400.51367,
                                        30877017133.725918,
                                        34010750117.75789,
                                        33336619225.34453,
                                        34073117201.547432,
                                        36770572224.432945,
                                        38501334334.97735,
                                        41051584175.89067,
                                        44329270515.12276,
                                        46207916407.69927,
                                        50299993881.05168,
                                        53570287372.133156,
                                        58274423153.69261,
                                        60652730322.79605
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017,
                                        2018
                                    ],
                                    "y": [
                                        25277349454.01009,
                                        25845234114.159317,
                                        26851039165.395077,
                                        27433633531.061214,
                                        30062386221.868687,
                                        28594697574.81331,
                                        28830114804.408085,
                                        30232269114.650925,
                                        29591353073.273907,
                                        29708546929.83754,
                                        31919895473.38672,
                                        32224005287.881935,
                                        32736590846.183186,
                                        35238155927.31132,
                                        36706001729.53555,
                                        39674293233.150955,
                                        42167146130.408226,
                                        44203728115.74115,
                                        47625270723.46556,
                                        50731078242.25296,
                                        55291163700.5988,
                                        57340566183.760605
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "מחירי 2016"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים, מותאמים לאינפלציה (במחירי 2016)",
                            "title": "בערכים ריאליים",
                            "type": "plotly"
                        },
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017
                                    ],
                                    "y": [
                                        4544.1399023015665,
                                        4579.2288238810015,
                                        4351.053498510623,
                                        4377.705361617336,
                                        4502.010290505138,
                                        4461.009724315464,
                                        4489.931996088786,
                                        4439.944781425731,
                                        4278.337301500973,
                                        4304.970003859712,
                                        4244.092029546546,
                                        4244.1406233942125,
                                        4412.765650134347,
                                        4512.474270161183,
                                        4609.984654061259,
                                        4625.311518150265,
                                        5229.193230242923,
                                        5246.4066630313855,
                                        5801.108205503396,
                                        5954.006699044145,
                                        6162.727739063551
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017
                                    ],
                                    "y": [
                                        4564.502024464852,
                                        4637.0010873522415,
                                        4471.821449848408,
                                        4442.40744565713,
                                        4743.014932082346,
                                        4540.131700083473,
                                        4543.3934774201825,
                                        4593.239335654859,
                                        4448.517539503568,
                                        4377.42137229056,
                                        4736.8073032071825,
                                        4561.161781050861,
                                        4551.821791379105,
                                        4823.255709170595,
                                        4957.80657948664,
                                        5189.505616066073,
                                        5500.3189462147,
                                        5624.480117789455,
                                        6002.314277998076,
                                        6268.463301209122,
                                        6687.9853963128335
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        1997,
                                        1998,
                                        1999,
                                        2000,
                                        2001,
                                        2002,
                                        2003,
                                        2004,
                                        2005,
                                        2006,
                                        2007,
                                        2008,
                                        2009,
                                        2010,
                                        2011,
                                        2012,
                                        2013,
                                        2014,
                                        2015,
                                        2016,
                                        2017
                                    ],
                                    "y": [
                                        4336.5556887251605,
                                        4328.677393632123,
                                        4383.628420713284,
                                        4362.022758230175,
                                        4668.79736323477,
                                        4352.313177292741,
                                        4309.627457794533,
                                        4440.045397951377,
                                        4269.974902710482,
                                        4211.767856562873,
                                        4445.605976711567,
                                        4408.93242226931,
                                        4373.275468390401,
                                        4622.246173371021,
                                        4726.622077511081,
                                        5015.396401384357,
                                        5232.0453297278,
                                        5380.528040379911,
                                        5683.138712362092,
                                        5936.2366302659675,
                                        6345.60541937025
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "תקציב לתושב, מחירי 2016"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים, מנורמלים לפי גודל האוכלוסיה ומותאמים לאינפלציה (במחירי 2016)",
                            "title": "תקציב ריאלי לתושב",
                            "type": "plotly"
                        }
                    ],
                    "title": "שינויי תקציב"
                },
                {
                    "chart": {
                        "centerHeight": 75,
                        "centerTitle": "משרד החינוך",
                        "centerWidth": 200,
                        "directionLeft": true,
                        "groups": [
                            {
                                "class": "budget-expense",
                                "flows": [
                                    {
                                        "context": null,
                                        "label": "העברות פנים תקציביות",
                                        "size": 80703000
                                    },
                                    {
                                        "context": null,
                                        "label": "קניות ורכש",
                                        "size": 3513883000
                                    },
                                    {
                                        "context": null,
                                        "label": "שכר",
                                        "size": 31909859000
                                    },
                                    {
                                        "context": null,
                                        "label": "העברות ותמיכות",
                                        "size": 47432947000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": true,
                                "offset": 100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            }
                        ],
                        "height": "520px",
                        "type": "mushonkey",
                        "width": "100%"
                    },
                    "long_title": "באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?",
                    "title": "דרכי שימוש",
                    "type": "mushonkey"
                }
            ],
            "children": [
                {
                    "code": "002060",
                    "net_allocated": 1854004000,
                    "net_revised": 1854004000,
                    "title": "יחידות מטה"
                },
                {
                    "code": "002061",
                    "net_allocated": 13705668000,
                    "net_revised": 13705668000,
                    "title": "חינוך מיוחד"
                },
                {
                    "code": "002062",
                    "net_allocated": 8326090000,
                    "net_revised": 8326090000,
                    "title": "קדם יסודי"
                },
                {
                    "code": "002063",
                    "net_allocated": 22525261000,
                    "net_revised": 22525261000,
                    "title": "יסודי וחטיבות ביניים"
                },
                {
                    "code": "002064",
                    "net_allocated": 13311138000,
                    "net_revised": 13311138000,
                    "title": "חטיבה עליונה"
                },
                {
                    "code": "002065",
                    "net_allocated": 4310107000,
                    "net_revised": 4310107000,
                    "title": "שירותי עזר, הסעות"
                },
                {
                    "code": "002066",
                    "net_allocated": 4586786000,
                    "net_revised": 4586786000,
                    "title": "חינוך התיישבותי"
                },
                {
                    "code": "002067",
                    "net_allocated": 5149915000,
                    "net_revised": 5149915000,
                    "title": "פעולות משלימות לקידום"
                },
                {
                    "code": "002068",
                    "net_allocated": 1705588000,
                    "net_revised": 1705588000,
                    "title": "מינהל עובדי הוראה"
                },
                {
                    "code": "002069",
                    "net_allocated": 2008325000,
                    "net_revised": 2008325000,
                    "title": "תמיכה בנושאי יהדות"
                },
                {
                    "code": "002070",
                    "net_allocated": 5454510000,
                    "net_revised": 5454510000,
                    "title": "רזרבות"
                },
                {
                    "code": "002099",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "חשבון מעבר"
                }
            ],
            "code": "0020",
            "commitment_allowance_allocated": 1884905000,
            "commitment_allowance_executed": null,
            "commitment_allowance_revised": 1884905000,
            "commitment_balance_allocated": 0,
            "commitment_balance_executed": null,
            "commitment_balance_revised": 0,
            "contractors_allocated": 0,
            "contractors_executed": null,
            "contractors_revised": 0,
            "covid19_expenses_allocated": 0,
            "covid19_expenses_executed": null,
            "covid19_expenses_revised": 0,
            "dedicated_allocated": -3612195000,
            "dedicated_executed": null,
            "dedicated_revised": -3612195000,
            "depth": 1,
            "direction": [
                "הכנסה",
                "הוצאה"
            ],
            "doc_id": "budget/0020/2024",
            "econ_cls_json": [
                "[\"002\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea\", \"173\", \"\\u05e8\\u05d6\\u05e8\\u05d1\\u05d4\"]",
                "[\"028\", \"\\u05d7\\u05e9\\u05d1\\u05d5\\u05e0\\u05d5\\u05ea \\u05de\\u05e2\\u05d1\\u05e8\", \"095\", \"\\u05d7\\u05e9\\u05d1\\u05d5\\u05e0\\u05d5\\u05ea \\u05de\\u05e2\\u05d1\\u05e8\"]",
                "[\"002\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea\", \"033\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea \\u05d1\\u05d0\\u05e8\\u05e5\"]",
                "[\"002\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea\", \"198\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea \\u05d1\\u05d7\\u05d5\\\"\\u05dc\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"031\", \"\\u05de\\u05d5\\u05e6\\u05e8\\u05d9\\u05dd \\u05e6\\u05d9\\u05d1\\u05d5\\u05e8\\u05d9\\u05d9\\u05dd\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"029\", \"\\u05e9\\u05db\\u05e8 \\u05e2\\u05e7\\u05d9\\u05e3\"]",
                "[\"019\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea  \\u05e4\\u05e0\\u05d9\\u05dd \\u05ea\\u05e7\\u05e6\\u05d9\\u05d1\\u05d9\\u05d5\\u05ea\", \"301\", \"\\u05d4\\u05e4\\u05d7\\u05ea\\u05d5\\u05ea\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"034\", \"\\u05ea\\u05e9\\u05dc\\u05d5\\u05de\\u05d9 \\u05d4\\u05e2\\u05d1\\u05e8\\u05d4 \\u05e1\\u05d5\\u05e6\\u05d9\\u05d0\\u05dc\\u05d9\\u05d9\\u05dd\"]",
                "[\"004\", \"\\u05d4\\u05db\\u05e0\\u05e1\\u05d5\\u05ea \\u05de\\u05d9\\u05d5\\u05e2\\u05d3\\u05d5\\u05ea\", \"041\", \"\\u05d4\\u05db\\u05e0\\u05e1\\u05d5\\u05ea \\u05ea\\u05e7\\u05e6\\u05d9\\u05d1 \\u05e8\\u05d2\\u05d9\\u05dc\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"036\", \"\\u05e8\\u05d6\\u05e8\\u05d1\\u05d4\"]",
                "[\"019\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea  \\u05e4\\u05e0\\u05d9\\u05dd \\u05ea\\u05e7\\u05e6\\u05d9\\u05d1\\u05d9\\u05d5\\u05ea\", \"300\", \"\\u05d4\\u05e9\\u05ea\\u05ea\\u05e4\\u05d5\\u05d9\\u05d5\\u05ea\"]",
                "[\"001\", \"\\u05e9\\u05db\\u05e8\", \"104\", \"\\u05e8\\u05d6\\u05e8\\u05d1\\u05d4\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"035\", \"\\u05ea\\u05de\\u05d9\\u05db\\u05d5\\u05ea \\u05dc\\u05e4\\u05d9 \\u05e1\\u05e2\\u05d9\\u05e3 3\\u05d0\"]",
                "[\"001\", \"\\u05e9\\u05db\\u05e8\", \"030\", \"\\u05e9\\u05db\\u05e8 \\u05d1\\u05d0\\u05e8\\u05e5\"]"
            ],
            "econ_cls_title_1": [
                "חשבונות מעבר",
                "העברות",
                "שכר",
                "העברות  פנים תקציביות",
                "קניות",
                "הכנסות מיועדות"
            ],
            "econ_cls_title_2": [
                "חשבונות מעבר",
                "הפחתות",
                "קניות בחו\"ל",
                "מוצרים ציבוריים",
                "תמיכות לפי סעיף 3א",
                "שכר עקיף",
                "הכנסות תקציב רגיל",
                "השתתפויות",
                "שכר בארץ",
                "רזרבה",
                "תשלומי העברה סוציאליים",
                "קניות בארץ"
            ],
            "explanation": null,
            "explanation_short": null,
            "explanation_source": null,
            "func_cls_json": [
                "[\"2\", \"\\u05e9\\u05d9\\u05e8\\u05d5\\u05ea\\u05d9\\u05dd \\u05d7\\u05d1\\u05e8\\u05ea\\u05d9\\u05d9\\u05dd\", \"22\", \"\\u05d7\\u05d9\\u05e0\\u05d5\\u05da\"]"
            ],
            "func_cls_title_1": [
                "שירותים חברתיים"
            ],
            "func_cls_title_2": [
                "חינוך"
            ],
            "gross_allocated": 3612195000,
            "gross_executed": null,
            "gross_revised": 3612195000,
            "hierarchy": [
                [
                    "00",
                    "המדינה"
                ]
            ],
            "history": {
                "1997": {
                    "amounts_allocated": 2099616,
                    "amounts_executed": 40868,
                    "amounts_revised": 2099616,
                    "code_titles": [
                        "0020:משרד החינוך והתרבות"
                    ],
                    "commitment_allowance_allocated": 501468000,
                    "commitment_allowance_executed": 1616518496,
                    "commitment_allowance_revised": 501468000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 393617724,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 7235,
                    "contractors_executed": 0,
                    "contractors_revised": 7235,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -420916000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -512709000,
                    "depth": 1,
                    "gross_allocated": 420916000,
                    "gross_executed": 0,
                    "gross_revised": 512709000,
                    "net_allocated": 17998587000,
                    "net_executed": 17176380244,
                    "net_revised": 18079238000,
                    "personnel_allocated": 2088.5,
                    "personnel_executed": 23715,
                    "personnel_revised": 2088,
                    "total_direction_expense": 18680632000,
                    "total_direction_income": -601394000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 312245000,
                    "total_econ_cls_procurement": 549884000,
                    "total_econ_cls_salaries": 7298886000,
                    "total_econ_cls_transfers": 9918223000
                },
                "1998": {
                    "amounts_allocated": 2558030,
                    "amounts_executed": 65047,
                    "amounts_revised": 2711030,
                    "code_titles": [
                        "0020:משרד החינוך והתרבות"
                    ],
                    "commitment_allowance_allocated": 493893000,
                    "commitment_allowance_executed": 788356632,
                    "commitment_allowance_revised": 493893000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 274307422,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 7485,
                    "contractors_executed": 2097,
                    "contractors_revised": 8176,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -472182000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -574541000,
                    "depth": 1,
                    "gross_allocated": 472182000,
                    "gross_executed": 0,
                    "gross_revised": 574541000,
                    "net_allocated": 19588376000,
                    "net_executed": 18516602605,
                    "net_revised": 19835506000,
                    "personnel_allocated": 2062,
                    "personnel_executed": 24386,
                    "personnel_revised": 2061.5,
                    "total_direction_expense": 20412529000,
                    "total_direction_income": -577023000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 346661000,
                    "total_econ_cls_procurement": 566763000,
                    "total_econ_cls_reserve": 394372000,
                    "total_econ_cls_salaries": 7942682000,
                    "total_econ_cls_transfers": 10585028000
                },
                "1999": {
                    "amounts_allocated": 2758329,
                    "amounts_executed": 1096250,
                    "amounts_revised": 2889646,
                    "code_titles": [
                        "0020:משרד החינוך והתרבות"
                    ],
                    "commitment_allowance_allocated": 499534000,
                    "commitment_allowance_executed": 796673799,
                    "commitment_allowance_revised": 623384000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 382721049,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 5562,
                    "contractors_executed": 10182,
                    "contractors_revised": 5994,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -479267000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1041832000,
                    "depth": 1,
                    "gross_allocated": 479267000,
                    "gross_executed": 0,
                    "gross_revised": 1041832000,
                    "net_allocated": 20085909000,
                    "net_executed": 20236285667,
                    "net_revised": 20643414000,
                    "personnel_allocated": 1964.5,
                    "personnel_executed": 1962,
                    "personnel_revised": 1965.5,
                    "total_direction_expense": 20791054000,
                    "total_direction_income": -147640000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 62732000,
                    "total_econ_cls_procurement": 677869000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 8235204000,
                    "total_econ_cls_transfers": 11667609000
                },
                "2000": {
                    "amounts_allocated": 4064416,
                    "amounts_executed": 1048680,
                    "amounts_revised": 4069986,
                    "code_titles": [
                        "0020:משרד החינוך והתרבות"
                    ],
                    "commitment_allowance_allocated": 1294248000,
                    "commitment_allowance_executed": 1674121118,
                    "commitment_allowance_revised": 1345248000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 651279877,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 5294,
                    "contractors_executed": 6696,
                    "contractors_revised": 5436,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1000805000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1080127000,
                    "depth": 1,
                    "gross_allocated": 1000805000,
                    "gross_executed": 0,
                    "gross_revised": 1080127000,
                    "net_allocated": 20983486000,
                    "net_executed": 20908315183,
                    "net_revised": 21293620000,
                    "personnel_allocated": 1896.5,
                    "personnel_executed": 1884.5,
                    "personnel_revised": 1903.5,
                    "total_direction_expense": 21414796000,
                    "total_direction_income": -121176000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 59945000,
                    "total_econ_cls_procurement": 893491000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 8809198000,
                    "total_econ_cls_transfers": 11530986000
                },
                "2001": {
                    "amounts_allocated": 4160730,
                    "amounts_executed": 996390,
                    "amounts_revised": 4204775,
                    "code_titles": [
                        "0020:משרד החינוך והתרבות"
                    ],
                    "commitment_allowance_allocated": 1326604000,
                    "commitment_allowance_executed": 1202348293,
                    "commitment_allowance_revised": 1326604000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 448920061,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 4775,
                    "contractors_executed": 6170,
                    "contractors_revised": 5065,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1008923000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1267220000,
                    "depth": 1,
                    "gross_allocated": 1008923000,
                    "gross_executed": 0,
                    "gross_revised": 1267220000,
                    "net_allocated": 22339703000,
                    "net_executed": 23167327423,
                    "net_revised": 23535607000,
                    "personnel_allocated": 1865,
                    "personnel_executed": 1877.5,
                    "personnel_revised": 1865,
                    "total_direction_expense": 23689115000,
                    "total_direction_income": -153508000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 46351000,
                    "total_econ_cls_procurement": 996629000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 9492421000,
                    "total_econ_cls_transfers": 13000206000
                },
                "2002": {
                    "amounts_allocated": 4910994,
                    "amounts_executed": 946144,
                    "amounts_revised": 4233336,
                    "code_titles": [
                        "0020:משרד החינוך והתרבות"
                    ],
                    "commitment_allowance_allocated": 2056963000,
                    "commitment_allowance_executed": 1541135755,
                    "commitment_allowance_revised": 2056963000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 638733328,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 4985,
                    "contractors_executed": 6062.5,
                    "contractors_revised": 5024,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1113670000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1348972000,
                    "depth": 1,
                    "gross_allocated": 1113670000,
                    "gross_executed": 0,
                    "gross_revised": 1348972000,
                    "net_allocated": 23870824000,
                    "net_executed": 23289189728,
                    "net_revised": 24294205000,
                    "personnel_allocated": 1827,
                    "personnel_executed": 1801.5,
                    "personnel_revised": 1835.5,
                    "total_direction_expense": 24430854000,
                    "total_direction_income": -136649000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 81576000,
                    "total_econ_cls_procurement": 970733000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 10109644000,
                    "total_econ_cls_transfers": 13132252000
                },
                "2003": {
                    "amounts_allocated": 4021426,
                    "amounts_executed": 919374,
                    "amounts_revised": 4210501,
                    "code_titles": [
                        "0020:משרד החינוך התרבות"
                    ],
                    "commitment_allowance_allocated": 2023849000,
                    "commitment_allowance_executed": 737777179,
                    "commitment_allowance_revised": 2023849000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 313206624,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 4934,
                    "contractors_executed": 6061.5,
                    "contractors_revised": 5030,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1184719000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1437934000,
                    "depth": 1,
                    "gross_allocated": 1184719000,
                    "gross_executed": 0,
                    "gross_revised": 1437934000,
                    "net_allocated": 24627762000,
                    "net_executed": 23638772131,
                    "net_revised": 24921004000,
                    "personnel_allocated": 1740.5,
                    "personnel_executed": 1739,
                    "personnel_revised": 1796,
                    "total_direction_expense": 25081051000,
                    "total_direction_income": -160047000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 31523000,
                    "total_econ_cls_procurement": 1008193000,
                    "total_econ_cls_reserve": 5146000,
                    "total_econ_cls_salaries": 9510849000,
                    "total_econ_cls_transfers": 14365293000
                },
                "2004": {
                    "amounts_allocated": 4654125,
                    "amounts_executed": 866896,
                    "amounts_revised": 4868008,
                    "code_titles": [
                        "0020:משרד החינוך התרבות"
                    ],
                    "commitment_allowance_allocated": 1463525000,
                    "commitment_allowance_executed": 84837459,
                    "commitment_allowance_revised": 1463525000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 423303527,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 6945,
                    "contractors_executed": 8099.5,
                    "contractors_revised": 8113,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1212967000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1369720000,
                    "depth": 1,
                    "gross_allocated": 1212967000,
                    "gross_executed": 0,
                    "gross_revised": 1369720000,
                    "net_allocated": 24685348000,
                    "net_executed": 24685907411,
                    "net_revised": 25537640000,
                    "personnel_allocated": 1672,
                    "personnel_executed": 1663,
                    "personnel_revised": 1749,
                    "total_direction_expense": 25745138000,
                    "total_direction_income": -207498000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 237076000,
                    "total_econ_cls_procurement": 936301000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 9921142000,
                    "total_econ_cls_transfers": 14443121000
                },
                "2005": {
                    "amounts_allocated": 7159435,
                    "amounts_executed": 980030,
                    "amounts_revised": 7255189,
                    "code_titles": [
                        "0020:משרד החינוך התרבות"
                    ],
                    "commitment_allowance_allocated": 1550811000,
                    "commitment_allowance_executed": 58577779,
                    "commitment_allowance_revised": 1505837000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 721295736,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 7618,
                    "contractors_executed": 9289.5,
                    "contractors_revised": 8588,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1332228000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1563663000,
                    "depth": 1,
                    "gross_allocated": 1332228000,
                    "gross_executed": 0,
                    "gross_revised": 1563663000,
                    "net_allocated": 24531094000,
                    "net_executed": 24483145749,
                    "net_revised": 25506872000,
                    "personnel_allocated": 1678,
                    "personnel_executed": 1642,
                    "personnel_revised": 1677,
                    "total_direction_expense": 26222801000,
                    "total_direction_income": -715929000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -413902000,
                    "total_econ_cls_procurement": 1043478000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 9352803000,
                    "total_econ_cls_transfers": 15524493000
                },
                "2006": {
                    "amounts_allocated": 7474809,
                    "amounts_executed": 936686,
                    "amounts_revised": 7225193,
                    "code_titles": [
                        "0020:משרד החינוך התרבות"
                    ],
                    "commitment_allowance_allocated": 1465566000,
                    "commitment_allowance_executed": 94865806,
                    "commitment_allowance_revised": 1465566000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 764424989,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 8857,
                    "contractors_executed": 9509,
                    "contractors_revised": 9048,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1476280000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1553065000,
                    "depth": 1,
                    "gross_allocated": 1476280000,
                    "gross_executed": 0,
                    "gross_revised": 1553065000,
                    "net_allocated": 25653928000,
                    "net_executed": 25098523160,
                    "net_revised": 26085676000,
                    "personnel_allocated": 1664,
                    "personnel_executed": 1616,
                    "personnel_revised": 1627,
                    "total_direction_expense": 26421650000,
                    "total_direction_income": -335974000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -45637000,
                    "total_econ_cls_procurement": 1083061000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 10132440000,
                    "total_econ_cls_transfers": 14915812000
                },
                "2007": {
                    "amounts_allocated": 6726877,
                    "amounts_executed": 941029,
                    "amounts_revised": 6936392,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 1465566000,
                    "commitment_allowance_executed": 131500845,
                    "commitment_allowance_revised": 1465566000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 2158162283,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 8724,
                    "contractors_executed": 9629.5,
                    "contractors_revised": 9012,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1517908000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1558930000,
                    "depth": 1,
                    "gross_allocated": 1517908000,
                    "gross_executed": 0,
                    "gross_revised": 1558930000,
                    "net_allocated": 25877676000,
                    "net_executed": 27106375236,
                    "net_revised": 28881929000,
                    "personnel_allocated": 1598,
                    "personnel_executed": 1578,
                    "personnel_revised": 1610,
                    "total_direction_expense": 29497885000,
                    "total_direction_income": -615956000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -249759000,
                    "total_econ_cls_procurement": 1243828000,
                    "total_econ_cls_reserve": 0,
                    "total_econ_cls_salaries": 11588684000,
                    "total_econ_cls_transfers": 16299176000
                },
                "2008": {
                    "amounts_allocated": 6950611,
                    "amounts_executed": 926891,
                    "amounts_revised": 7064889,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 1465566000,
                    "commitment_allowance_executed": 144120500,
                    "commitment_allowance_revised": 1146598000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 953927226,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 9165,
                    "contractors_executed": 9761,
                    "contractors_revised": 9299,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1512418000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1578632000,
                    "depth": 1,
                    "gross_allocated": 1512418000,
                    "gross_executed": 0,
                    "gross_revised": 1578632000,
                    "net_allocated": 27551845000,
                    "net_executed": 28621630029,
                    "net_revised": 29609863000,
                    "personnel_allocated": 1543,
                    "personnel_executed": 1520,
                    "personnel_revised": 1535,
                    "total_direction_expense": 30426008000,
                    "total_direction_income": -816145000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -457531000,
                    "total_econ_cls_procurement": 1244286000,
                    "total_econ_cls_salaries": 12054640000,
                    "total_econ_cls_transfers": 16768468000
                },
                "2009": {
                    "amounts_allocated": 7007178,
                    "amounts_executed": 925442,
                    "amounts_revised": 7145852,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 1465566000,
                    "commitment_allowance_executed": 56374702,
                    "commitment_allowance_revised": 1460566000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 1220904920,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 3665,
                    "contractors_executed": 6214.5,
                    "contractors_revised": 3044,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1550552000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1586097000,
                    "depth": 1,
                    "gross_allocated": 1550552000,
                    "gross_executed": 0,
                    "gross_revised": 1586097000,
                    "net_allocated": 30311997000,
                    "net_executed": 30040732590,
                    "net_revised": 31267196000,
                    "personnel_allocated": 1961,
                    "personnel_executed": 1896.5,
                    "personnel_revised": 2036,
                    "total_direction_expense": 31616973000,
                    "total_direction_income": -349777000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -40205000,
                    "total_econ_cls_procurement": 1307474000,
                    "total_econ_cls_salaries": 12747460000,
                    "total_econ_cls_transfers": 17252467000
                },
                "2010": {
                    "amounts_allocated": 7643198,
                    "amounts_executed": 1001265,
                    "amounts_revised": 7901900,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 268828000,
                    "commitment_allowance_executed": 148032669,
                    "commitment_allowance_revised": 350878000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 1418719658,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 3380,
                    "contractors_executed": 4264,
                    "contractors_revised": 4808,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1564058000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1621104000,
                    "depth": 1,
                    "gross_allocated": 1564058000,
                    "gross_executed": 0,
                    "gross_revised": 1621104000,
                    "net_allocated": 32418924000,
                    "net_executed": 33207557192,
                    "net_revised": 34651668000,
                    "personnel_allocated": 1957,
                    "personnel_executed": 1941,
                    "personnel_revised": 1967,
                    "total_direction_expense": 35046579000,
                    "total_direction_income": -394911000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -33274000,
                    "total_econ_cls_procurement": 1465822000,
                    "total_econ_cls_salaries": 14125340000,
                    "total_econ_cls_transfers": 19093780000
                },
                "2011": {
                    "amounts_allocated": 8889020,
                    "amounts_executed": 1093172,
                    "amounts_revised": 8948104,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 171500000,
                    "commitment_allowance_executed": 248339794,
                    "commitment_allowance_revised": 546179000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 1838417545,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 3182,
                    "contractors_executed": 4363,
                    "contractors_revised": 1913,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1595386000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1681812000,
                    "depth": 1,
                    "gross_allocated": 1595386000,
                    "gross_executed": 0,
                    "gross_revised": 1681812000,
                    "net_allocated": 34901335000,
                    "net_executed": 35784375204,
                    "net_revised": 37534630000,
                    "personnel_allocated": 2092,
                    "personnel_executed": 2040.5,
                    "personnel_revised": 2209,
                    "total_direction_expense": 37924158000,
                    "total_direction_income": -389528000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -25929000,
                    "total_econ_cls_procurement": 1650296000,
                    "total_econ_cls_salaries": 15514540000,
                    "total_econ_cls_transfers": 20395723000
                },
                "2012": {
                    "amounts_allocated": 9105389,
                    "amounts_executed": 1220396,
                    "amounts_revised": 9322576,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 157000000,
                    "commitment_allowance_executed": 563586548,
                    "commitment_allowance_revised": 680484000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 1870450755,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 3160,
                    "contractors_executed": 3184,
                    "contractors_revised": 3242,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1595076000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -1998132000,
                    "depth": 1,
                    "gross_allocated": 1595076000,
                    "gross_executed": 0,
                    "gross_revised": 1998132000,
                    "net_allocated": 36278439000,
                    "net_executed": 39338053598,
                    "net_revised": 40703672000,
                    "personnel_allocated": 2081,
                    "personnel_executed": 2127.5,
                    "personnel_revised": 2123.5,
                    "total_direction_expense": 41130998000,
                    "total_direction_income": -427326000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -18321000,
                    "total_econ_cls_procurement": 1865004000,
                    "total_econ_cls_salaries": 16999087000,
                    "total_econ_cls_transfers": 21857902000
                },
                "2013": {
                    "amounts_allocated": 10386485,
                    "amounts_executed": 1069730,
                    "amounts_revised": 10411516,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 157000000,
                    "commitment_allowance_executed": 37730297,
                    "commitment_allowance_revised": 157000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 2138580205,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 1535,
                    "contractors_executed": 2771,
                    "contractors_revised": 1535,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1678477000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -2101395000,
                    "depth": 1,
                    "gross_allocated": 1678477000,
                    "gross_executed": 0,
                    "gross_revised": 2101395000,
                    "net_allocated": 42425121000,
                    "net_executed": 42448260452,
                    "net_revised": 44624799000,
                    "personnel_allocated": 2248,
                    "personnel_executed": 2150,
                    "personnel_revised": 2248,
                    "total_direction_expense": 45065558000,
                    "total_direction_income": -440759000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": -13050000,
                    "total_econ_cls_procurement": 2638140000,
                    "total_econ_cls_salaries": 18337497000,
                    "total_econ_cls_transfers": 23662212000
                },
                "2014": {
                    "amounts_allocated": 10382187,
                    "amounts_executed": 1223252,
                    "amounts_revised": 10761788,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 193000000,
                    "commitment_allowance_executed": 68002960,
                    "commitment_allowance_revised": 193000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 1973032886,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 1510,
                    "contractors_executed": 2592.5,
                    "contractors_revised": 1518,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -1681286000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -2250230000,
                    "depth": 1,
                    "gross_allocated": 1681286000,
                    "gross_executed": 0,
                    "gross_revised": 2250230000,
                    "net_allocated": 43595011000,
                    "net_executed": 44709492453,
                    "net_revised": 46736612000,
                    "personnel_allocated": 2241,
                    "personnel_executed": 2156,
                    "personnel_revised": 2225.5,
                    "total_direction_expense": 47104437000,
                    "total_direction_income": -367825000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 40832000,
                    "total_econ_cls_procurement": 2893672000,
                    "total_econ_cls_salaries": 19596534000,
                    "total_econ_cls_transfers": 24205574000
                },
                "2015": {
                    "amounts_allocated": 10796522,
                    "amounts_executed": 1132545,
                    "amounts_revised": 11074077,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 802484000,
                    "commitment_allowance_executed": 1547387809,
                    "commitment_allowance_revised": 1897520000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 3549397955,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 1318,
                    "contractors_executed": 2417.5,
                    "contractors_revised": 1318,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -2302377000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -2386533000,
                    "depth": 1,
                    "gross_allocated": 2302377000,
                    "gross_executed": 0,
                    "gross_revised": 2386533000,
                    "net_allocated": 48859772000,
                    "net_executed": 47866175202,
                    "net_revised": 50554428000,
                    "personnel_allocated": 2409,
                    "personnel_executed": 2173,
                    "personnel_revised": 2409,
                    "total_direction_expense": 50926265000,
                    "total_direction_income": -371837000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 8651000,
                    "total_econ_cls_procurement": 1869967000,
                    "total_econ_cls_salaries": 20255072000,
                    "total_econ_cls_transfers": 28420738000
                },
                "2016": {
                    "amounts_allocated": 11503436,
                    "amounts_executed": 1263020,
                    "amounts_revised": 11631444,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 540807000,
                    "commitment_allowance_executed": 2157052983,
                    "commitment_allowance_revised": 2387595000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 4382103247,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 1932,
                    "contractors_executed": 2654.5,
                    "contractors_revised": 1932,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -2302377000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -2343808000,
                    "depth": 1,
                    "gross_allocated": 2302377000,
                    "gross_executed": 0,
                    "gross_revised": 2343808000,
                    "net_allocated": 50861316000,
                    "net_executed": 50709517534,
                    "net_revised": 53547520000,
                    "personnel_allocated": 2374,
                    "personnel_executed": 2212,
                    "personnel_revised": 2374,
                    "total_direction_expense": 53930871000,
                    "total_direction_income": -383351000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 23042000,
                    "total_econ_cls_procurement": 2148785000,
                    "total_econ_cls_salaries": 21053727000,
                    "total_econ_cls_transfers": 30321966000
                },
                "2017": {
                    "amounts_allocated": 11831222,
                    "amounts_executed": 1284992,
                    "amounts_revised": 11860873,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 2147000000,
                    "commitment_allowance_executed": 1707694410,
                    "commitment_allowance_revised": 2147000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 4354017787,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 1592,
                    "contractors_executed": 2616,
                    "contractors_revised": 1664,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -2387698000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -2654176000,
                    "depth": 1,
                    "gross_allocated": 2387698000,
                    "gross_executed": 0,
                    "gross_revised": 2654176000,
                    "net_allocated": 53805091000,
                    "net_executed": 55401746028,
                    "net_revised": 58390972000,
                    "personnel_allocated": 2381,
                    "personnel_executed": 2284,
                    "personnel_revised": 2390,
                    "total_direction_expense": 58794758000,
                    "total_direction_income": -403786000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 7511000,
                    "total_econ_cls_procurement": 2404468000,
                    "total_econ_cls_salaries": 22399332000,
                    "total_econ_cls_transfers": 33579661000
                },
                "2018": {
                    "amounts_allocated": 12148546,
                    "amounts_executed": 1253334,
                    "amounts_revised": 12442132,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 2147000000,
                    "commitment_allowance_executed": 1400776228,
                    "commitment_allowance_revised": 2147000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 4370994140,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 1612,
                    "contractors_executed": 2513.5,
                    "contractors_revised": 1811,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -2387698000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -3043076000,
                    "depth": 1,
                    "gross_allocated": 2387698000,
                    "gross_executed": 0,
                    "gross_revised": 3043076000,
                    "net_allocated": 56174410000,
                    "net_executed": 57918750207,
                    "net_revised": 61264312000,
                    "personnel_allocated": 2376,
                    "personnel_executed": 2276,
                    "personnel_revised": 2389,
                    "total_direction_expense": 61723400000,
                    "total_direction_income": -459088000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 13928000,
                    "total_econ_cls_procurement": 2375531000,
                    "total_econ_cls_salaries": 23030704000,
                    "total_econ_cls_transfers": 35844149000
                },
                "2019": {
                    "amounts_allocated": 12412963,
                    "amounts_executed": 1155730,
                    "amounts_revised": 12497381,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 1747000000,
                    "commitment_allowance_executed": 1231871950,
                    "commitment_allowance_revised": 1747000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 4261037831,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 518,
                    "contractors_executed": 2387,
                    "contractors_revised": 602,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -2721905000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -3139084000,
                    "depth": 1,
                    "gross_allocated": 2721905000,
                    "gross_executed": 0,
                    "gross_revised": 3139084000,
                    "net_allocated": 60456672000,
                    "net_executed": 60947384862,
                    "net_revised": 64125147000,
                    "personnel_allocated": 2308,
                    "personnel_executed": 2326.5,
                    "personnel_revised": 2412,
                    "total_direction_expense": 64594167000,
                    "total_direction_income": -469020000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 25132000,
                    "total_econ_cls_procurement": 2503405000,
                    "total_econ_cls_salaries": 24100171000,
                    "total_econ_cls_transfers": 37496439000
                },
                "2020": {
                    "amounts_executed": 1193299,
                    "amounts_revised": 1284445,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_executed": 2244124494,
                    "commitment_allowance_revised": 2655203000,
                    "commitment_balance_executed": 6299691459,
                    "commitment_balance_revised": 0,
                    "contractors_executed": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_executed": 0,
                    "dedicated_revised": -3150628000,
                    "depth": 1,
                    "gross_executed": 0,
                    "gross_revised": 3150628000,
                    "net_executed": 64030668117,
                    "net_revised": 68999783000,
                    "personnel_executed": 2615.5,
                    "personnel_revised": 2450,
                    "total_direction_expense": 69220393000,
                    "total_direction_income": -220610000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 27774000,
                    "total_econ_cls_procurement": 2989132000,
                    "total_econ_cls_salaries": 24186988000,
                    "total_econ_cls_transfers": 41795889000
                },
                "2021": {
                    "amounts_allocated": 4214303,
                    "amounts_executed": 1201665.13,
                    "amounts_revised": 4214303,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 1898000000,
                    "commitment_allowance_executed": 1070431144,
                    "commitment_allowance_revised": 1898000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 5619346831,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_executed": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -3022195000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -3189715000,
                    "depth": 1,
                    "gross_allocated": 3022195000,
                    "gross_executed": 0,
                    "gross_revised": 3189715000,
                    "net_allocated": 67636134000,
                    "net_executed": 66380500348,
                    "net_revised": 71759037000,
                    "personnel_allocated": 2452,
                    "personnel_executed": 2393.92,
                    "personnel_revised": 2452,
                    "total_direction_expense": 71915402000,
                    "total_direction_income": -156365000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 73705000,
                    "total_econ_cls_procurement": 3129183000,
                    "total_econ_cls_salaries": 26040994000,
                    "total_econ_cls_transfers": 42515155000
                },
                "2022": {
                    "amounts_allocated": 7504848,
                    "amounts_revised": 7542461,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 1898000000,
                    "commitment_allowance_revised": 1964672000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -3062195000,
                    "dedicated_revised": -3447171000,
                    "depth": 1,
                    "gross_allocated": 3062195000,
                    "gross_revised": 3447171000,
                    "net_allocated": 67812808000,
                    "net_revised": 74618184000,
                    "personnel_allocated": 2438.5,
                    "personnel_revised": 2547.5,
                    "total_direction_expense": 74791974000,
                    "total_direction_income": -173790000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 65601000,
                    "total_econ_cls_procurement": 3683236000,
                    "total_econ_cls_salaries": 27278590000,
                    "total_econ_cls_transfers": 43590757000
                },
                "2023": {
                    "amounts_allocated": 7092953,
                    "amounts_revised": 7092953,
                    "code_titles": [
                        "0020:משרד החינוך"
                    ],
                    "commitment_allowance_allocated": 1889942000,
                    "commitment_allowance_revised": 1889942000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -3612195000,
                    "dedicated_revised": -3612195000,
                    "depth": 1,
                    "gross_allocated": 3612195000,
                    "gross_revised": 3612195000,
                    "net_allocated": 77776056000,
                    "net_revised": 77776056000,
                    "personnel_allocated": 2594.5,
                    "personnel_revised": 2594.5,
                    "total_direction_expense": 77920421000,
                    "total_direction_income": -144365000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_interim_accounts": 0,
                    "total_econ_cls_internal_transfers": 67343000,
                    "total_econ_cls_procurement": 2729750000,
                    "total_econ_cls_salaries": 30246044000,
                    "total_econ_cls_transfers": 44732919000
                }
            },
            "net_allocated": 82937392000,
            "net_executed": null,
            "net_revised": 82937392000,
            "nice-breadcrumbs": "1997 - 2024",
            "nice-category": "שירותים חברתיים / חינוך",
            "nice-code": "20",
            "nice-econ-category": "קניות-רזרבה, חשבונות מעבר-חשבונות מעבר, קניות-קניות בארץ, קניות-קניות בחו\"ל, העברות-מוצרים ציבוריים, העברות-שכר עקיף, העברות  פנים תקציביות-הפחתות, העברות-תשלומי העברה סוציאליים, הכנסות מיועדות-הכנסות תקציב רגיל, העברות-רזרבה, העברות  פנים תקציביות-השתתפויות, שכר-רזרבה, העברות-תמיכות לפי סעיף 3א, שכר-שכר בארץ",
            "nice-prefixes": [
                "0020",
                "20"
            ],
            "nice-short-category": "חינוך",
            "non_repeating": [
                false
            ],
            "page_title": "תקציב משרד החינוך (20)",
            "parent": "00",
            "personnel_allocated": 2632.5,
            "personnel_executed": null,
            "personnel_revised": 2632.5,
            "rev_created_at": "2023-03-23",
            "rev_last_modified_at": "2023-10-01",
            "rev_last_updated_at": "2023-10-01",
            "score": 82937392,
            "semantic_tags": [],
            "simple-code": "20",
            "title": "משרד החינוך",
            "total_direction_expense": 83081757000,
            "total_direction_income": -144365000,
            "total_econ_cls_capital_expenditure": null,
            "total_econ_cls_credit": null,
            "total_econ_cls_debt_repayment_interest": null,
            "total_econ_cls_debt_repayment_principal": null,
            "total_econ_cls_dedicated_income": 0,
            "total_econ_cls_income": null,
            "total_econ_cls_income_bank_of_israel": null,
            "total_econ_cls_income_grants": null,
            "total_econ_cls_income_loans": null,
            "total_econ_cls_interim_accounts": 0,
            "total_econ_cls_internal_transfers": 80703000,
            "total_econ_cls_investment": null,
            "total_econ_cls_procurement": 3513883000,
            "total_econ_cls_reserve": null,
            "total_econ_cls_salaries": 31909859000,
            "total_econ_cls_transfers": 47432947000,
            "year": 2024
        },
        {
            "__created_at": "2023-03-23T19:25:54Z",
            "__date_range_from": "2024-01-01",
            "__date_range_months": [
                "2024-01",
                "2024-02",
                "2024-03",
                "2024-04",
                "2024-05",
                "2024-06",
                "2024-07",
                "2024-08",
                "2024-09",
                "2024-10",
                "2024-11",
                "2024-12"
            ],
            "__date_range_to": "2024-12-31",
            "__hash": "7be73b6e66573d6dc8bccad6540c98b6",
            "__is_new": false,
            "__is_stale": true,
            "__last_modified_at": "2023-10-01T12:30:58Z",
            "__last_updated_at": "2023-10-01T12:30:58Z",
            "__next_update_days": 1,
            "__revision": 278,
            "__staleness": 133333,
            "admin_cls_code_0": [
                "1"
            ],
            "amounts_allocated": 5236,
            "amounts_executed": null,
            "amounts_revised": 5236,
            "charts": [
                {
                    "chart": {
                        "centerHeight": 75,
                        "centerTitle": "פעולות משלימות לקידום",
                        "centerWidth": 200,
                        "directionLeft": true,
                        "groups": [
                            {
                                "class": "budget-parent",
                                "flows": [
                                    {
                                        "context": "budget/0020/2024",
                                        "label": "משרד החינוך ›",
                                        "size": 5149915000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": false,
                                "offset": -100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            },
                            {
                                "class": "budget-expense",
                                "flows": [
                                    {
                                        "context": "budget/00206703/2024",
                                        "label": "‹ (…03) מינהל החינוך הדתי",
                                        "size": 209854000
                                    },
                                    {
                                        "context": "budget/00206702/2024",
                                        "label": "‹ (…02) הארכת יום הלימודים",
                                        "size": 1820143000
                                    },
                                    {
                                        "context": "budget/00206701/2024",
                                        "label": "‹ (…01) פעילויות ופרוייקטים",
                                        "size": 3119918000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": true,
                                "offset": 100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            }
                        ],
                        "height": "490px",
                        "type": "mushonkey",
                        "width": "100%"
                    },
                    "description": null,
                    "long_title": "מהם תתי הסעיפים של סעיף זה?",
                    "title": "מבנה התקציב",
                    "type": "mushonkey"
                },
                {
                    "long_title": "איך התקציב בסעיף זה השתנה לאורך השנים?",
                    "subcharts": [
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        null,
                                        5180655000,
                                        5427659000,
                                        4652113000,
                                        5149915000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        8062245000,
                                        6807389000,
                                        8227539000,
                                        4652113000,
                                        5149915000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        5306155053,
                                        4099506711,
                                        null,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "תקציב ב-₪"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)",
                            "title": "נומינלית",
                            "type": "plotly"
                        }
                    ],
                    "title": "שינויי תקציב"
                },
                {
                    "chart": {
                        "centerHeight": 75,
                        "centerTitle": "פעולות משלימות לקידום",
                        "centerWidth": 200,
                        "directionLeft": true,
                        "groups": [
                            {
                                "class": "budget-expense",
                                "flows": [
                                    {
                                        "context": null,
                                        "label": "שכר",
                                        "size": 4136000
                                    },
                                    {
                                        "context": null,
                                        "label": "העברות פנים תקציביות",
                                        "size": 7350000
                                    },
                                    {
                                        "context": null,
                                        "label": "קניות ורכש",
                                        "size": 761222000
                                    },
                                    {
                                        "context": null,
                                        "label": "העברות ותמיכות",
                                        "size": 4377207000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": true,
                                "offset": 100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            }
                        ],
                        "height": "520px",
                        "type": "mushonkey",
                        "width": "100%"
                    },
                    "long_title": "באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?",
                    "title": "דרכי שימוש",
                    "type": "mushonkey"
                }
            ],
            "children": [
                {
                    "code": "00206701",
                    "net_allocated": 3119918000,
                    "net_revised": 3119918000,
                    "title": "פעילויות ופרוייקטים"
                },
                {
                    "code": "00206702",
                    "net_allocated": 1820143000,
                    "net_revised": 1820143000,
                    "title": "הארכת יום הלימודים"
                },
                {
                    "code": "00206703",
                    "net_allocated": 209854000,
                    "net_revised": 209854000,
                    "title": "מינהל החינוך הדתי"
                }
            ],
            "code": "002067",
            "commitment_allowance_allocated": 1442000000,
            "commitment_allowance_executed": null,
            "commitment_allowance_revised": 1442000000,
            "commitment_balance_allocated": 0,
            "commitment_balance_executed": null,
            "commitment_balance_revised": 0,
            "contractors_allocated": 0,
            "contractors_executed": null,
            "contractors_revised": 0,
            "covid19_expenses_allocated": 0,
            "covid19_expenses_executed": null,
            "covid19_expenses_revised": 0,
            "dedicated_allocated": -695770000,
            "dedicated_executed": null,
            "dedicated_revised": -695770000,
            "depth": 2,
            "direction": [
                "הכנסה",
                "הוצאה"
            ],
            "doc_id": "budget/002067/2024",
            "econ_cls_json": [
                "[\"002\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea\", \"033\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea \\u05d1\\u05d0\\u05e8\\u05e5\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"031\", \"\\u05de\\u05d5\\u05e6\\u05e8\\u05d9\\u05dd \\u05e6\\u05d9\\u05d1\\u05d5\\u05e8\\u05d9\\u05d9\\u05dd\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"029\", \"\\u05e9\\u05db\\u05e8 \\u05e2\\u05e7\\u05d9\\u05e3\"]",
                "[\"004\", \"\\u05d4\\u05db\\u05e0\\u05e1\\u05d5\\u05ea \\u05de\\u05d9\\u05d5\\u05e2\\u05d3\\u05d5\\u05ea\", \"041\", \"\\u05d4\\u05db\\u05e0\\u05e1\\u05d5\\u05ea \\u05ea\\u05e7\\u05e6\\u05d9\\u05d1 \\u05e8\\u05d2\\u05d9\\u05dc\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"036\", \"\\u05e8\\u05d6\\u05e8\\u05d1\\u05d4\"]",
                "[\"019\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea  \\u05e4\\u05e0\\u05d9\\u05dd \\u05ea\\u05e7\\u05e6\\u05d9\\u05d1\\u05d9\\u05d5\\u05ea\", \"300\", \"\\u05d4\\u05e9\\u05ea\\u05ea\\u05e4\\u05d5\\u05d9\\u05d5\\u05ea\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"035\", \"\\u05ea\\u05de\\u05d9\\u05db\\u05d5\\u05ea \\u05dc\\u05e4\\u05d9 \\u05e1\\u05e2\\u05d9\\u05e3 3\\u05d0\"]",
                "[\"001\", \"\\u05e9\\u05db\\u05e8\", \"030\", \"\\u05e9\\u05db\\u05e8 \\u05d1\\u05d0\\u05e8\\u05e5\"]"
            ],
            "econ_cls_title_1": [
                "העברות",
                "שכר",
                "העברות  פנים תקציביות",
                "קניות",
                "הכנסות מיועדות"
            ],
            "econ_cls_title_2": [
                "מוצרים ציבוריים",
                "תמיכות לפי סעיף 3א",
                "שכר עקיף",
                "הכנסות תקציב רגיל",
                "השתתפויות",
                "שכר בארץ",
                "רזרבה",
                "קניות בארץ"
            ],
            "explanation": null,
            "explanation_short": null,
            "explanation_source": null,
            "func_cls_json": [
                "[\"2\", \"\\u05e9\\u05d9\\u05e8\\u05d5\\u05ea\\u05d9\\u05dd \\u05d7\\u05d1\\u05e8\\u05ea\\u05d9\\u05d9\\u05dd\", \"22\", \"\\u05d7\\u05d9\\u05e0\\u05d5\\u05da\"]"
            ],
            "func_cls_title_1": [
                "שירותים חברתיים"
            ],
            "func_cls_title_2": [
                "חינוך"
            ],
            "gross_allocated": 695770000,
            "gross_executed": null,
            "gross_revised": 695770000,
            "hierarchy": [
                [
                    "00",
                    "המדינה"
                ],
                [
                    "0020",
                    "משרד החינוך"
                ]
            ],
            "history": {
                "2020": {
                    "amounts_executed": 0,
                    "amounts_revised": 0,
                    "code_titles": [
                        "002067:פעולות משלימות לקידום"
                    ],
                    "commitment_allowance_executed": 1103890849,
                    "commitment_allowance_revised": 1342203000,
                    "commitment_balance_executed": 3598006155,
                    "commitment_balance_revised": 0,
                    "contractors_executed": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_executed": 0,
                    "dedicated_revised": -646152000,
                    "depth": 2,
                    "gross_executed": 0,
                    "gross_revised": 646152000,
                    "net_executed": 5306155053,
                    "net_revised": 8062245000,
                    "personnel_executed": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 8112855000,
                    "total_direction_income": -50610000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": -28260000,
                    "total_econ_cls_procurement": 1614409000,
                    "total_econ_cls_salaries": 1295000,
                    "total_econ_cls_transfers": 6474801000
                },
                "2021": {
                    "amounts_allocated": 568,
                    "amounts_executed": 0,
                    "amounts_revised": 568,
                    "code_titles": [
                        "002067:פעולות משלימות לקידום"
                    ],
                    "commitment_allowance_allocated": 1419000000,
                    "commitment_allowance_executed": 1040446111,
                    "commitment_allowance_revised": 1419000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 3240437397,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_executed": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -638810000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -658476000,
                    "depth": 2,
                    "gross_allocated": 638810000,
                    "gross_executed": 0,
                    "gross_revised": 658476000,
                    "net_allocated": 5180655000,
                    "net_executed": 4099506711,
                    "net_revised": 6807389000,
                    "personnel_allocated": 0,
                    "personnel_executed": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 6807389000,
                    "total_direction_income": 0,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": 7350000,
                    "total_econ_cls_procurement": 1660105000,
                    "total_econ_cls_salaries": 4078000,
                    "total_econ_cls_transfers": 5135856000
                },
                "2022": {
                    "amounts_allocated": 5040,
                    "amounts_revised": 5040,
                    "code_titles": [
                        "002067:פעולות משלימות לקידום"
                    ],
                    "commitment_allowance_allocated": 1419000000,
                    "commitment_allowance_revised": 1419000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -638810000,
                    "dedicated_revised": -713795000,
                    "depth": 2,
                    "gross_allocated": 638810000,
                    "gross_revised": 713795000,
                    "net_allocated": 5427659000,
                    "net_revised": 8227539000,
                    "personnel_allocated": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 8233839000,
                    "total_direction_income": -6300000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": 1050000,
                    "total_econ_cls_procurement": 1982431000,
                    "total_econ_cls_salaries": 4087000,
                    "total_econ_cls_transfers": 6239971000
                },
                "2023": {
                    "amounts_allocated": 5098,
                    "amounts_revised": 5098,
                    "code_titles": [
                        "002067:פעולות משלימות לקידום"
                    ],
                    "commitment_allowance_allocated": 1442000000,
                    "commitment_allowance_revised": 1442000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -695770000,
                    "dedicated_revised": -695770000,
                    "depth": 2,
                    "gross_allocated": 695770000,
                    "gross_revised": 695770000,
                    "net_allocated": 4652113000,
                    "net_revised": 4652113000,
                    "personnel_allocated": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 4652113000,
                    "total_direction_income": 0,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": 7350000,
                    "total_econ_cls_procurement": 511803000,
                    "total_econ_cls_salaries": 4112000,
                    "total_econ_cls_transfers": 4128848000
                }
            },
            "net_allocated": 5149915000,
            "net_executed": null,
            "net_revised": 5149915000,
            "nice-breadcrumbs": "2020 - 2024 / משרד החינוך",
            "nice-category": "שירותים חברתיים / חינוך",
            "nice-code": "20.67",
            "nice-econ-category": "קניות-קניות בארץ, העברות-מוצרים ציבוריים, העברות-שכר עקיף, הכנסות מיועדות-הכנסות תקציב רגיל, העברות-רזרבה, העברות  פנים תקציביות-השתתפויות, העברות-תמיכות לפי סעיף 3א, שכר-שכר בארץ",
            "nice-prefixes": [
                "0020",
                "002067",
                "20",
                "20.",
                "20.67",
                "2067"
            ],
            "nice-short-category": "חינוך",
            "non_repeating": [
                false
            ],
            "page_title": "תקציב פעולות משלימות לקידום (20.67)",
            "parent": "0020",
            "personnel_allocated": 0,
            "personnel_executed": null,
            "personnel_revised": 0,
            "rev_created_at": "2023-03-23",
            "rev_last_modified_at": "2023-10-01",
            "rev_last_updated_at": "2023-10-01",
            "score": 5149915,
            "semantic_tags": [],
            "simple-code": "2067",
            "title": "פעולות משלימות לקידום",
            "total_direction_expense": 5149915000,
            "total_direction_income": 0,
            "total_econ_cls_capital_expenditure": null,
            "total_econ_cls_credit": null,
            "total_econ_cls_debt_repayment_interest": null,
            "total_econ_cls_debt_repayment_principal": null,
            "total_econ_cls_dedicated_income": 0,
            "total_econ_cls_income": null,
            "total_econ_cls_income_bank_of_israel": null,
            "total_econ_cls_income_grants": null,
            "total_econ_cls_income_loans": null,
            "total_econ_cls_interim_accounts": null,
            "total_econ_cls_internal_transfers": 7350000,
            "total_econ_cls_investment": null,
            "total_econ_cls_procurement": 761222000,
            "total_econ_cls_reserve": null,
            "total_econ_cls_salaries": 4136000,
            "total_econ_cls_transfers": 4377207000,
            "year": 2024
        },
        {
            "__created_at": "2023-03-23T19:25:54Z",
            "__date_range_from": "2024-01-01",
            "__date_range_months": [
                "2024-01",
                "2024-02",
                "2024-03",
                "2024-04",
                "2024-05",
                "2024-06",
                "2024-07",
                "2024-08",
                "2024-09",
                "2024-10",
                "2024-11",
                "2024-12"
            ],
            "__date_range_to": "2024-12-31",
            "__hash": "632b99e6349b4b336bedb152ae561b27",
            "__is_new": false,
            "__is_stale": true,
            "__last_modified_at": "2023-10-01T12:30:58Z",
            "__last_updated_at": "2023-10-01T12:30:58Z",
            "__next_update_days": 1,
            "__revision": 278,
            "__staleness": 133333,
            "admin_cls_code_0": [
                "1"
            ],
            "amounts_allocated": 4436,
            "amounts_executed": null,
            "amounts_revised": 4436,
            "charts": [
                {
                    "chart": {
                        "centerHeight": 75,
                        "centerTitle": "פעילויות ופרוייקטים",
                        "centerWidth": 200,
                        "directionLeft": true,
                        "groups": [
                            {
                                "class": "budget-parent",
                                "flows": [
                                    {
                                        "context": "budget/002067/2024",
                                        "label": "פעולות משלימות לקידום ›",
                                        "size": 3119918000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": false,
                                "offset": -100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            },
                            {
                                "class": "budget-expense",
                                "flows": [
                                    {
                                        "context": "budget/0020670128/2024",
                                        "label": "‹ (…28) פעולות חינוך בלתי פורמאלי - הקצבה לרשויות ובעלויות",
                                        "size": 183000
                                    },
                                    {
                                        "context": "budget/0020670103/2024",
                                        "label": "‹ (…03) תכניות לקידום המיעוטים",
                                        "size": 600000
                                    },
                                    {
                                        "context": "budget/0020670174/2024",
                                        "label": "‹ (…74) החברה למתנסים - פעולות",
                                        "size": 644000
                                    },
                                    {
                                        "context": "budget/0020670159/2024",
                                        "label": "‹ (…59) תמיכה במרכז למחקר ולהוראת הטבע והנוף על פי מורשת ישראל",
                                        "size": 716000
                                    },
                                    {
                                        "context": "budget/0020670120/2024",
                                        "label": "‹ (…20) פעולות ויוזמות בקליטת עליה - הקצבות לרשויות מקומיות",
                                        "size": 982000
                                    },
                                    {
                                        "context": "budget/0020670154/2024",
                                        "label": "‹ (…54) ענן מיחשוב - חוות דעת",
                                        "size": 1653000
                                    },
                                    {
                                        "context": "budget/0020670129/2024",
                                        "label": "‹ (…29) פעולות פדגוגיות - הקצבה ולרשויות ובעלויות",
                                        "size": 1802000
                                    },
                                    {
                                        "context": "budget/0020670141/2024",
                                        "label": "‹ (…41) פעילות התנדבותית למען הקהילה של תלמידי י\"א-י\"ב",
                                        "size": 2044000
                                    },
                                    {
                                        "context": "budget/0020670145/2024",
                                        "label": "‹ (…45) התכנית להשאלת ספרי לימוד",
                                        "size": 2063000
                                    },
                                    {
                                        "context": "budget/0020670189/2024",
                                        "label": "‹ (…89) תמיכה במוזיאונים",
                                        "size": 2515000
                                    },
                                    {
                                        "context": "budget/0020670105/2024",
                                        "label": "‹ (…05) רכישות מנהלי מחוזות",
                                        "size": 2564000
                                    },
                                    {
                                        "context": "budget/0020670117/2024",
                                        "label": "‹ (…17) תוכניות חינוכיות",
                                        "size": 2997000
                                    },
                                    {
                                        "context": "budget/0020670137/2024",
                                        "label": "‹ (…37) כפרי סטודנטים",
                                        "size": 3840000
                                    },
                                    {
                                        "context": "budget/0020670108/2024",
                                        "label": "‹ (…08) תגבור שירותי החינוך בעיר לוד - החלטת ממשלה",
                                        "size": 3871000
                                    },
                                    {
                                        "context": "budget/0020670148/2024",
                                        "label": "‹ (…48) תוכנית לימודים לחינוך מדעי וטכנולוגי",
                                        "size": 4045000
                                    },
                                    {
                                        "context": "budget/0020670130/2024",
                                        "label": "‹ (…30) מייזמים למחוננים ומצטיינים",
                                        "size": 4316000
                                    },
                                    {
                                        "context": "budget/0020670143/2024",
                                        "label": "‹ (…43) פעולות עם נוער בסיכון",
                                        "size": 4366000
                                    },
                                    {
                                        "context": "budget/0020670132/2024",
                                        "label": "‹ (…32) מענק ירושלים לחינוך",
                                        "size": 4488000
                                    },
                                    {
                                        "context": "budget/0020670139/2024",
                                        "label": "‹ (…39) הוצאות מטה ניהול עצמי והעצמה של בתי ספר חלשים",
                                        "size": 5793000
                                    },
                                    {
                                        "context": "budget/0020670134/2024",
                                        "label": "‹ (…34) רכישת שירותים עבור פעילויות  נדרשות",
                                        "size": 5948000
                                    },
                                    {
                                        "context": "budget/0020670119/2024",
                                        "label": "‹ (…19) קריות לחינוך ומחקר סביבתי",
                                        "size": 6546000
                                    },
                                    {
                                        "context": "budget/0020670152/2024",
                                        "label": "‹ (…52) נוער מחונן בחינוך העל-יסודי",
                                        "size": 6925000
                                    },
                                    {
                                        "context": "budget/0020670196/2024",
                                        "label": "‹ (…96) השתתפות - משטרת ישראל",
                                        "size": 7350000
                                    },
                                    {
                                        "context": "budget/0020670106/2024",
                                        "label": "‹ (…06) מלגות ומענקים לתלמידים",
                                        "size": 7421000
                                    },
                                    {
                                        "context": "budget/0020670169/2024",
                                        "label": "‹ (…69) הקצבות ללימוד המורשת הנוצרית בבתי ספר כנסייתיים",
                                        "size": 8072000
                                    },
                                    {
                                        "context": "budget/0020670102/2024",
                                        "label": "‹ (…02) תכנית החומש לקידום החינוך הערבי",
                                        "size": 8198000
                                    },
                                    {
                                        "context": "budget/0020670191/2024",
                                        "label": "‹ (…91) תמיכה במוסדות ציבור בתחומי הדרכה, סיורים חינוכיים, טבע וסביבה",
                                        "size": 8255000
                                    },
                                    {
                                        "context": "budget/0020670133/2024",
                                        "label": "‹ (…33) תמיכות בפעילויות שונות בהתאם למדיניות המשרד",
                                        "size": 8659000
                                    },
                                    {
                                        "context": "budget/0020670123/2024",
                                        "label": "‹ (…23) סל תלמיד עולה - העברה לרשויות מקומיות ובעלויות חינוך",
                                        "size": 9252000
                                    },
                                    {
                                        "context": "budget/0020670167/2024",
                                        "label": "‹ (…67) השתתפות במכינות קדם אקדמיות",
                                        "size": 9278000
                                    },
                                    {
                                        "context": "budget/0020670188/2024",
                                        "label": "‹ (…88) תמיכה באכסניות חינוכיות לילדים ונוער",
                                        "size": 9674000
                                    },
                                    {
                                        "context": "budget/0020670153/2024",
                                        "label": "‹ (…53) הפעלת שעות לזהירות בדרכים",
                                        "size": 9838000
                                    },
                                    {
                                        "context": "budget/0020670131/2024",
                                        "label": "‹ (…31) תכנית אקדמיה למצטיינים",
                                        "size": 9931000
                                    },
                                    {
                                        "context": "budget/0020670179/2024",
                                        "label": "‹ (…79) גרעין חינוכי לאומי",
                                        "size": 10015000
                                    },
                                    {
                                        "context": "budget/0020670197/2024",
                                        "label": "‹ (…97) מוקדי קליטה ברשויות המקומיות",
                                        "size": 10313000
                                    },
                                    {
                                        "context": "budget/0020670183/2024",
                                        "label": "‹ (…83) תכניות לקידום מצוינות במתמטיקה, מדעים ושפות",
                                        "size": 10800000
                                    },
                                    {
                                        "context": "budget/0020670144/2024",
                                        "label": "‹ (…44) פעולות ופרויקטים",
                                        "size": 10960000
                                    },
                                    {
                                        "context": "budget/0020670193/2024",
                                        "label": "‹ (…93) פעולות פדגוגית - רכישת שירותים",
                                        "size": 11207000
                                    },
                                    {
                                        "context": "budget/0020670190/2024",
                                        "label": "‹ (…90) תמיכה במדריכים מוסיקליים בקונסרבטוריונים",
                                        "size": 12647000
                                    },
                                    {
                                        "context": "budget/0020670118/2024",
                                        "label": "‹ (…18) הקצבות באחריות מנהלי מחוזות - פעילויות ויוזמות",
                                        "size": 12687000
                                    },
                                    {
                                        "context": "budget/0020670163/2024",
                                        "label": "‹ (…63) מכינות אופק לנוער בסיכון",
                                        "size": 16193000
                                    },
                                    {
                                        "context": "budget/0020670185/2024",
                                        "label": "‹ (…85) רזרבה לשכר מורים",
                                        "size": 16882000
                                    },
                                    {
                                        "context": "budget/0020670116/2024",
                                        "label": "‹ (…16) שכר לימוד למסגרות נוער - רשויות",
                                        "size": 18329000
                                    },
                                    {
                                        "context": "budget/0020670101/2024",
                                        "label": "‹ (…01) הנגשה",
                                        "size": 19032000
                                    },
                                    {
                                        "context": "budget/0020670150/2024",
                                        "label": "‹ (…50) פרויקט עתידים לעידוד תלמידים מצטיינים בפריפריה",
                                        "size": 22648000
                                    },
                                    {
                                        "context": "budget/0020670138/2024",
                                        "label": "‹ (…38) פעולות ויוזמות - ילדים ונוער בסיכון",
                                        "size": 23220000
                                    },
                                    {
                                        "context": "budget/0020670175/2024",
                                        "label": "‹ (…75) הקצבות מדע וטכנולוגיה",
                                        "size": 26312000
                                    },
                                    {
                                        "context": "budget/0020670140/2024",
                                        "label": "‹ (…40) הפעלת קבוצת מחנכים",
                                        "size": 26433000
                                    },
                                    {
                                        "context": "budget/0020670126/2024",
                                        "label": "‹ (…26) סיוע וטיפוח",
                                        "size": 30545000
                                    },
                                    {
                                        "context": "budget/0020670187/2024",
                                        "label": "‹ (…87) תמיכה בארגוני נוער",
                                        "size": 35932000
                                    },
                                    {
                                        "context": "budget/0020670165/2024",
                                        "label": "‹ (…65) פעולות חינוך בלתי פורמאלי - רכישת שירותים",
                                        "size": 39443000
                                    },
                                    {
                                        "context": "budget/0020670147/2024",
                                        "label": "‹ (…47) תמיכה בתיכונים חרדיים עיוניים וטכנולוגיים",
                                        "size": 41456000
                                    },
                                    {
                                        "context": "budget/0020670110/2024",
                                        "label": "‹ (…10) פעולות לקידום מערכת החינוך - הקצבה לרשויות ובעלויות",
                                        "size": 43419000
                                    },
                                    {
                                        "context": "budget/0020670112/2024",
                                        "label": "‹ (…12) הדרך החדשה",
                                        "size": 44156000
                                    },
                                    {
                                        "context": "budget/0020670170/2024",
                                        "label": "‹ (…70) ייעודה לתכניות מיעוטים",
                                        "size": 45525000
                                    },
                                    {
                                        "context": "budget/0020670136/2024",
                                        "label": "‹ (…36) השתלמויות עובדי הוראה",
                                        "size": 49736000
                                    },
                                    {
                                        "context": "budget/0020670162/2024",
                                        "label": "‹ (…62) מתנדבים לשנת שירות",
                                        "size": 49909000
                                    },
                                    {
                                        "context": "budget/0020670124/2024",
                                        "label": "‹ (…24) שעורי עזר לעולים - על יסודי",
                                        "size": 59205000
                                    },
                                    {
                                        "context": "budget/0020670182/2024",
                                        "label": "‹ (…82) פעולות ויוזמות",
                                        "size": 60673000
                                    },
                                    {
                                        "context": "budget/0020670127/2024",
                                        "label": "‹ (…27) פעולות התערבות יחודיות",
                                        "size": 64000000
                                    },
                                    {
                                        "context": "budget/0020670192/2024",
                                        "label": "‹ (…92) פעולות מדע וטכנולוגיה",
                                        "size": 73103000
                                    },
                                    {
                                        "context": "budget/0020670142/2024",
                                        "label": "‹ (…42) תמיכה בתנועות נוער",
                                        "size": 87709000
                                    },
                                    {
                                        "context": "budget/0020670135/2024",
                                        "label": "‹ (…35) החברה למתנ\"סים",
                                        "size": 88212000
                                    },
                                    {
                                        "context": "budget/0020670113/2024",
                                        "label": "‹ (…13) מועדוניות משפחתיות ותוכניות התערבות למניעת נשירה",
                                        "size": 89874000
                                    },
                                    {
                                        "context": "budget/0020670104/2024",
                                        "label": "‹ (…04) שירות לאומי אזרחי",
                                        "size": 98169000
                                    },
                                    {
                                        "context": "budget/0020670111/2024",
                                        "label": "‹ (…11) פעולות לקידום מערכת החינוך - רכישת שירותים",
                                        "size": 98809000
                                    },
                                    {
                                        "context": "budget/0020670114/2024",
                                        "label": "‹ (…14) מעקב אחרי ביקור סדיר של תלמידים",
                                        "size": 103025000
                                    },
                                    {
                                        "context": "budget/0020670156/2024",
                                        "label": "‹ (…56) בתי הספר של החופש הגדול",
                                        "size": 136800000
                                    },
                                    {
                                        "context": "budget/0020670176/2024",
                                        "label": "‹ (…76) פעולות לתקשוב המערכת",
                                        "size": 146175000
                                    },
                                    {
                                        "context": "budget/0020670115/2024",
                                        "label": "‹ (…15) שכר לימוד למסגרות נוער",
                                        "size": 177930000
                                    },
                                    {
                                        "context": "budget/0020670194/2024",
                                        "label": "‹ (…94) מיזמים משותפים במערכת החינוך",
                                        "size": 190404000
                                    },
                                    {
                                        "context": "budget/0020670146/2024",
                                        "label": "‹ (…46) תכנית ללימודי הומניסטיקה",
                                        "size": 192576000
                                    },
                                    {
                                        "context": "budget/0020670172/2024",
                                        "label": "‹ (…72) תכניות בחינוך הבלתי פוראמלי",
                                        "size": 258173000
                                    },
                                    {
                                        "context": "budget/0020670186/2024",
                                        "label": "‹ (…86) אחזקת תחנות פסיכולוגיות ברשויות מקומיות",
                                        "size": 402453000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": true,
                                "offset": 100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            }
                        ],
                        "height": "2620px",
                        "type": "mushonkey",
                        "width": "100%"
                    },
                    "description": null,
                    "long_title": "מהם תתי הסעיפים של סעיף זה?",
                    "title": "מבנה התקציב",
                    "type": "mushonkey"
                },
                {
                    "long_title": "איך התקציב בסעיף זה השתנה לאורך השנים?",
                    "subcharts": [
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        null,
                                        3260722000,
                                        3677372000,
                                        2675779000,
                                        3119918000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        5229136000,
                                        4670790000,
                                        5772397000,
                                        2675779000,
                                        3119918000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        2020,
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        3277266860,
                                        2565572849,
                                        null,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "תקציב ב-₪"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)",
                            "title": "נומינלית",
                            "type": "plotly"
                        }
                    ],
                    "title": "שינויי תקציב"
                },
                {
                    "chart": {
                        "centerHeight": 75,
                        "centerTitle": "פעילויות ופרוייקטים",
                        "centerWidth": 200,
                        "directionLeft": true,
                        "groups": [
                            {
                                "class": "budget-expense",
                                "flows": [
                                    {
                                        "context": null,
                                        "label": "העברות פנים תקציביות",
                                        "size": 7350000
                                    },
                                    {
                                        "context": null,
                                        "label": "קניות ורכש",
                                        "size": 761222000
                                    },
                                    {
                                        "context": null,
                                        "label": "העברות ותמיכות",
                                        "size": 2351346000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": true,
                                "offset": 100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            }
                        ],
                        "height": "490px",
                        "type": "mushonkey",
                        "width": "100%"
                    },
                    "long_title": "באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?",
                    "title": "דרכי שימוש",
                    "type": "mushonkey"
                }
            ],
            "children": [
                {
                    "code": "0020670101",
                    "net_allocated": 19032000,
                    "net_revised": 19032000,
                    "title": "הנגשה"
                },
                {
                    "code": "0020670102",
                    "net_allocated": 8198000,
                    "net_revised": 8198000,
                    "title": "תכנית החומש לקידום החינוך הערבי"
                },
                {
                    "code": "0020670103",
                    "net_allocated": 600000,
                    "net_revised": 600000,
                    "title": "תכניות לקידום המיעוטים"
                },
                {
                    "code": "0020670104",
                    "net_allocated": 98169000,
                    "net_revised": 98169000,
                    "title": "שירות לאומי אזרחי"
                },
                {
                    "code": "0020670105",
                    "net_allocated": 2564000,
                    "net_revised": 2564000,
                    "title": "רכישות מנהלי מחוזות"
                },
                {
                    "code": "0020670106",
                    "net_allocated": 7421000,
                    "net_revised": 7421000,
                    "title": "מלגות ומענקים לתלמידים"
                },
                {
                    "code": "0020670107",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "הכנסות מגורמי חוץ"
                },
                {
                    "code": "0020670108",
                    "net_allocated": 3871000,
                    "net_revised": 3871000,
                    "title": "תגבור שירותי החינוך בעיר לוד - החלטת ממשלה"
                },
                {
                    "code": "0020670109",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "אחזקת ילדי צד\"ל"
                },
                {
                    "code": "0020670110",
                    "net_allocated": 43419000,
                    "net_revised": 43419000,
                    "title": "פעולות לקידום מערכת החינוך - הקצבה לרשויות ובעלויות"
                },
                {
                    "code": "0020670111",
                    "net_allocated": 98809000,
                    "net_revised": 98809000,
                    "title": "פעולות לקידום מערכת החינוך - רכישת שירותים"
                },
                {
                    "code": "0020670112",
                    "net_allocated": 44156000,
                    "net_revised": 44156000,
                    "title": "הדרך החדשה"
                },
                {
                    "code": "0020670113",
                    "net_allocated": 89874000,
                    "net_revised": 89874000,
                    "title": "מועדוניות משפחתיות ותוכניות התערבות למניעת נשירה"
                },
                {
                    "code": "0020670114",
                    "net_allocated": 103025000,
                    "net_revised": 103025000,
                    "title": "מעקב אחרי ביקור סדיר של תלמידים"
                },
                {
                    "code": "0020670115",
                    "net_allocated": 177930000,
                    "net_revised": 177930000,
                    "title": "שכר לימוד למסגרות נוער"
                },
                {
                    "code": "0020670116",
                    "net_allocated": 18329000,
                    "net_revised": 18329000,
                    "title": "שכר לימוד למסגרות נוער - רשויות"
                },
                {
                    "code": "0020670117",
                    "net_allocated": 2997000,
                    "net_revised": 2997000,
                    "title": "תוכניות חינוכיות"
                },
                {
                    "code": "0020670118",
                    "net_allocated": 12687000,
                    "net_revised": 12687000,
                    "title": "הקצבות באחריות מנהלי מחוזות - פעילויות ויוזמות"
                },
                {
                    "code": "0020670119",
                    "net_allocated": 6546000,
                    "net_revised": 6546000,
                    "title": "קריות לחינוך ומחקר סביבתי"
                },
                {
                    "code": "0020670120",
                    "net_allocated": 982000,
                    "net_revised": 982000,
                    "title": "פעולות ויוזמות בקליטת עליה - הקצבות לרשויות מקומיות"
                },
                {
                    "code": "0020670121",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "סל תלמיד עולה מאתיופיה - העברה לרשויות מקומיות"
                },
                {
                    "code": "0020670123",
                    "net_allocated": 9252000,
                    "net_revised": 9252000,
                    "title": "סל תלמיד עולה - העברה לרשויות מקומיות ובעלויות חינוך"
                },
                {
                    "code": "0020670124",
                    "net_allocated": 59205000,
                    "net_revised": 59205000,
                    "title": "שעורי עזר לעולים - על יסודי"
                },
                {
                    "code": "0020670126",
                    "net_allocated": 30545000,
                    "net_revised": 30545000,
                    "title": "סיוע וטיפוח"
                },
                {
                    "code": "0020670127",
                    "net_allocated": 64000000,
                    "net_revised": 64000000,
                    "title": "פעולות התערבות יחודיות"
                },
                {
                    "code": "0020670128",
                    "net_allocated": 183000,
                    "net_revised": 183000,
                    "title": "פעולות חינוך בלתי פורמאלי - הקצבה לרשויות ובעלויות"
                },
                {
                    "code": "0020670129",
                    "net_allocated": 1802000,
                    "net_revised": 1802000,
                    "title": "פעולות פדגוגיות - הקצבה ולרשויות ובעלויות"
                },
                {
                    "code": "0020670130",
                    "net_allocated": 4316000,
                    "net_revised": 4316000,
                    "title": "מייזמים למחוננים ומצטיינים"
                },
                {
                    "code": "0020670131",
                    "net_allocated": 9931000,
                    "net_revised": 9931000,
                    "title": "תכנית אקדמיה למצטיינים"
                },
                {
                    "code": "0020670132",
                    "net_allocated": 4488000,
                    "net_revised": 4488000,
                    "title": "מענק ירושלים לחינוך"
                },
                {
                    "code": "0020670133",
                    "net_allocated": 8659000,
                    "net_revised": 8659000,
                    "title": "תמיכות בפעילויות שונות בהתאם למדיניות המשרד"
                },
                {
                    "code": "0020670134",
                    "net_allocated": 5948000,
                    "net_revised": 5948000,
                    "title": "רכישת שירותים עבור פעילויות  נדרשות"
                },
                {
                    "code": "0020670135",
                    "net_allocated": 88212000,
                    "net_revised": 88212000,
                    "title": "החברה למתנ\"סים"
                },
                {
                    "code": "0020670136",
                    "net_allocated": 49736000,
                    "net_revised": 49736000,
                    "title": "השתלמויות עובדי הוראה"
                },
                {
                    "code": "0020670137",
                    "net_allocated": 3840000,
                    "net_revised": 3840000,
                    "title": "כפרי סטודנטים"
                },
                {
                    "code": "0020670138",
                    "net_allocated": 23220000,
                    "net_revised": 23220000,
                    "title": "פעולות ויוזמות - ילדים ונוער בסיכון"
                },
                {
                    "code": "0020670139",
                    "net_allocated": 5793000,
                    "net_revised": 5793000,
                    "title": "הוצאות מטה ניהול עצמי והעצמה של בתי ספר חלשים"
                },
                {
                    "code": "0020670140",
                    "net_allocated": 26433000,
                    "net_revised": 26433000,
                    "title": "הפעלת קבוצת מחנכים"
                },
                {
                    "code": "0020670141",
                    "net_allocated": 2044000,
                    "net_revised": 2044000,
                    "title": "פעילות התנדבותית למען הקהילה של תלמידי י\"א-י\"ב"
                },
                {
                    "code": "0020670142",
                    "net_allocated": 87709000,
                    "net_revised": 87709000,
                    "title": "תמיכה בתנועות נוער"
                },
                {
                    "code": "0020670143",
                    "net_allocated": 4366000,
                    "net_revised": 4366000,
                    "title": "פעולות עם נוער בסיכון"
                },
                {
                    "code": "0020670144",
                    "net_allocated": 10960000,
                    "net_revised": 10960000,
                    "title": "פעולות ופרויקטים"
                },
                {
                    "code": "0020670145",
                    "net_allocated": 2063000,
                    "net_revised": 2063000,
                    "title": "התכנית להשאלת ספרי לימוד"
                },
                {
                    "code": "0020670146",
                    "net_allocated": 192576000,
                    "net_revised": 192576000,
                    "title": "תכנית ללימודי הומניסטיקה"
                },
                {
                    "code": "0020670147",
                    "net_allocated": 41456000,
                    "net_revised": 41456000,
                    "title": "תמיכה בתיכונים חרדיים עיוניים וטכנולוגיים"
                },
                {
                    "code": "0020670148",
                    "net_allocated": 4045000,
                    "net_revised": 4045000,
                    "title": "תוכנית לימודים לחינוך מדעי וטכנולוגי"
                },
                {
                    "code": "0020670149",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "מנהל תחום התנדבותי רשתי"
                },
                {
                    "code": "0020670150",
                    "net_allocated": 22648000,
                    "net_revised": 22648000,
                    "title": "פרויקט עתידים לעידוד תלמידים מצטיינים בפריפריה"
                },
                {
                    "code": "0020670151",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "הכנסות תקשוב - מרשויות מקומיות"
                },
                {
                    "code": "0020670152",
                    "net_allocated": 6925000,
                    "net_revised": 6925000,
                    "title": "נוער מחונן בחינוך העל-יסודי"
                },
                {
                    "code": "0020670153",
                    "net_allocated": 9838000,
                    "net_revised": 9838000,
                    "title": "הפעלת שעות לזהירות בדרכים"
                },
                {
                    "code": "0020670154",
                    "net_allocated": 1653000,
                    "net_revised": 1653000,
                    "title": "ענן מיחשוב - חוות דעת"
                },
                {
                    "code": "0020670155",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "הקצבות ייעודיות לבעלויות - תשלומים מזכירות פדגוגית"
                },
                {
                    "code": "0020670156",
                    "net_allocated": 136800000,
                    "net_revised": 136800000,
                    "title": "בתי הספר של החופש הגדול"
                },
                {
                    "code": "0020670157",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "תוכנית קרב"
                },
                {
                    "code": "0020670158",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "הכנסות - תכנית קרב"
                },
                {
                    "code": "0020670159",
                    "net_allocated": 716000,
                    "net_revised": 716000,
                    "title": "תמיכה במרכז למחקר ולהוראת הטבע והנוף על פי מורשת ישראל"
                },
                {
                    "code": "0020670160",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "חינוך פיננסי"
                },
                {
                    "code": "0020670161",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "מלחמה בסמים"
                },
                {
                    "code": "0020670162",
                    "net_allocated": 49909000,
                    "net_revised": 49909000,
                    "title": "מתנדבים לשנת שירות"
                },
                {
                    "code": "0020670163",
                    "net_allocated": 16193000,
                    "net_revised": 16193000,
                    "title": "מכינות אופק לנוער בסיכון"
                },
                {
                    "code": "0020670164",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "מכינות קדם צבאיות"
                },
                {
                    "code": "0020670165",
                    "net_allocated": 39443000,
                    "net_revised": 39443000,
                    "title": "פעולות חינוך בלתי פורמאלי - רכישת שירותים"
                },
                {
                    "code": "0020670166",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "אתגרים-פעילות עם הרשויות"
                },
                {
                    "code": "0020670167",
                    "net_allocated": 9278000,
                    "net_revised": 9278000,
                    "title": "השתתפות במכינות קדם אקדמיות"
                },
                {
                    "code": "0020670168",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "הקצאת שעות לבתי ספר לפרוייקטים"
                },
                {
                    "code": "0020670169",
                    "net_allocated": 8072000,
                    "net_revised": 8072000,
                    "title": "הקצבות ללימוד המורשת הנוצרית בבתי ספר כנסייתיים"
                },
                {
                    "code": "0020670170",
                    "net_allocated": 45525000,
                    "net_revised": 45525000,
                    "title": "ייעודה לתכניות מיעוטים"
                },
                {
                    "code": "0020670171",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "החברה למתנסים - התחייבות יחסי עובד מעביד"
                },
                {
                    "code": "0020670172",
                    "net_allocated": 258173000,
                    "net_revised": 258173000,
                    "title": "תכניות בחינוך הבלתי פוראמלי"
                },
                {
                    "code": "0020670174",
                    "net_allocated": 644000,
                    "net_revised": 644000,
                    "title": "החברה למתנסים - פעולות"
                },
                {
                    "code": "0020670175",
                    "net_allocated": 26312000,
                    "net_revised": 26312000,
                    "title": "הקצבות מדע וטכנולוגיה"
                },
                {
                    "code": "0020670176",
                    "net_allocated": 146175000,
                    "net_revised": 146175000,
                    "title": "פעולות לתקשוב המערכת"
                },
                {
                    "code": "0020670177",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "ליווי, תגבור וטיפול בחטיבה העליונה"
                },
                {
                    "code": "0020670179",
                    "net_allocated": 10015000,
                    "net_revised": 10015000,
                    "title": "גרעין חינוכי לאומי"
                },
                {
                    "code": "0020670180",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "פעולות תומכות בבתי הספר"
                },
                {
                    "code": "0020670181",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "השתתפות משרד הביטחון"
                },
                {
                    "code": "0020670182",
                    "net_allocated": 60673000,
                    "net_revised": 60673000,
                    "title": "פעולות ויוזמות"
                },
                {
                    "code": "0020670183",
                    "net_allocated": 10800000,
                    "net_revised": 10800000,
                    "title": "תכניות לקידום מצוינות במתמטיקה, מדעים ושפות"
                },
                {
                    "code": "0020670185",
                    "net_allocated": 16882000,
                    "net_revised": 16882000,
                    "title": "רזרבה לשכר מורים"
                },
                {
                    "code": "0020670186",
                    "net_allocated": 402453000,
                    "net_revised": 402453000,
                    "title": "אחזקת תחנות פסיכולוגיות ברשויות מקומיות"
                },
                {
                    "code": "0020670187",
                    "net_allocated": 35932000,
                    "net_revised": 35932000,
                    "title": "תמיכה בארגוני נוער"
                },
                {
                    "code": "0020670188",
                    "net_allocated": 9674000,
                    "net_revised": 9674000,
                    "title": "תמיכה באכסניות חינוכיות לילדים ונוער"
                },
                {
                    "code": "0020670189",
                    "net_allocated": 2515000,
                    "net_revised": 2515000,
                    "title": "תמיכה במוזיאונים"
                },
                {
                    "code": "0020670190",
                    "net_allocated": 12647000,
                    "net_revised": 12647000,
                    "title": "תמיכה במדריכים מוסיקליים בקונסרבטוריונים"
                },
                {
                    "code": "0020670191",
                    "net_allocated": 8255000,
                    "net_revised": 8255000,
                    "title": "תמיכה במוסדות ציבור בתחומי הדרכה, סיורים חינוכיים, טבע וסביבה"
                },
                {
                    "code": "0020670192",
                    "net_allocated": 73103000,
                    "net_revised": 73103000,
                    "title": "פעולות מדע וטכנולוגיה"
                },
                {
                    "code": "0020670193",
                    "net_allocated": 11207000,
                    "net_revised": 11207000,
                    "title": "פעולות פדגוגית - רכישת שירותים"
                },
                {
                    "code": "0020670194",
                    "net_allocated": 190404000,
                    "net_revised": 190404000,
                    "title": "מיזמים משותפים במערכת החינוך"
                },
                {
                    "code": "0020670195",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "תרבות יהודית ישראלית"
                },
                {
                    "code": "0020670196",
                    "net_allocated": 7350000,
                    "net_revised": 7350000,
                    "title": "השתתפות - משטרת ישראל"
                },
                {
                    "code": "0020670197",
                    "net_allocated": 10313000,
                    "net_revised": 10313000,
                    "title": "מוקדי קליטה ברשויות המקומיות"
                },
                {
                    "code": "0020670198",
                    "net_allocated": 0,
                    "net_revised": 0,
                    "title": "פעולות לצמצום פערים"
                }
            ],
            "code": "00206701",
            "commitment_allowance_allocated": 50000000,
            "commitment_allowance_executed": null,
            "commitment_allowance_revised": 50000000,
            "commitment_balance_allocated": 0,
            "commitment_balance_executed": null,
            "commitment_balance_revised": 0,
            "contractors_allocated": 0,
            "contractors_executed": null,
            "contractors_revised": 0,
            "covid19_expenses_allocated": 0,
            "covid19_expenses_executed": null,
            "covid19_expenses_revised": 0,
            "dedicated_allocated": -145770000,
            "dedicated_executed": null,
            "dedicated_revised": -145770000,
            "depth": 3,
            "direction": [
                "הכנסה",
                "הוצאה"
            ],
            "doc_id": "budget/00206701/2024",
            "econ_cls_json": [
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"035\", \"\\u05ea\\u05de\\u05d9\\u05db\\u05d5\\u05ea \\u05dc\\u05e4\\u05d9 \\u05e1\\u05e2\\u05d9\\u05e3 3\\u05d0\"]",
                "[\"002\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea\", \"033\", \"\\u05e7\\u05e0\\u05d9\\u05d5\\u05ea \\u05d1\\u05d0\\u05e8\\u05e5\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"031\", \"\\u05de\\u05d5\\u05e6\\u05e8\\u05d9\\u05dd \\u05e6\\u05d9\\u05d1\\u05d5\\u05e8\\u05d9\\u05d9\\u05dd\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"029\", \"\\u05e9\\u05db\\u05e8 \\u05e2\\u05e7\\u05d9\\u05e3\"]",
                "[\"004\", \"\\u05d4\\u05db\\u05e0\\u05e1\\u05d5\\u05ea \\u05de\\u05d9\\u05d5\\u05e2\\u05d3\\u05d5\\u05ea\", \"041\", \"\\u05d4\\u05db\\u05e0\\u05e1\\u05d5\\u05ea \\u05ea\\u05e7\\u05e6\\u05d9\\u05d1 \\u05e8\\u05d2\\u05d9\\u05dc\"]",
                "[\"019\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea  \\u05e4\\u05e0\\u05d9\\u05dd \\u05ea\\u05e7\\u05e6\\u05d9\\u05d1\\u05d9\\u05d5\\u05ea\", \"300\", \"\\u05d4\\u05e9\\u05ea\\u05ea\\u05e4\\u05d5\\u05d9\\u05d5\\u05ea\"]",
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"036\", \"\\u05e8\\u05d6\\u05e8\\u05d1\\u05d4\"]"
            ],
            "econ_cls_title_1": [
                "קניות",
                "העברות  פנים תקציביות",
                "הכנסות מיועדות",
                "העברות"
            ],
            "econ_cls_title_2": [
                "מוצרים ציבוריים",
                "תמיכות לפי סעיף 3א",
                "שכר עקיף",
                "הכנסות תקציב רגיל",
                "קניות בארץ",
                "רזרבה",
                "השתתפויות"
            ],
            "explanation": null,
            "explanation_short": null,
            "explanation_source": null,
            "func_cls_json": [
                "[\"2\", \"\\u05e9\\u05d9\\u05e8\\u05d5\\u05ea\\u05d9\\u05dd \\u05d7\\u05d1\\u05e8\\u05ea\\u05d9\\u05d9\\u05dd\", \"22\", \"\\u05d7\\u05d9\\u05e0\\u05d5\\u05da\"]"
            ],
            "func_cls_title_1": [
                "שירותים חברתיים"
            ],
            "func_cls_title_2": [
                "חינוך"
            ],
            "gross_allocated": 145770000,
            "gross_executed": null,
            "gross_revised": 145770000,
            "hierarchy": [
                [
                    "00",
                    "המדינה"
                ],
                [
                    "0020",
                    "משרד החינוך"
                ],
                [
                    "002067",
                    "פעולות משלימות לקידום"
                ]
            ],
            "history": {
                "2020": {
                    "amounts_executed": 0,
                    "amounts_revised": 0,
                    "code_titles": [
                        "00206701:פעילויות ופרוייקטים"
                    ],
                    "commitment_allowance_executed": 0,
                    "commitment_allowance_revised": 82527000,
                    "commitment_balance_executed": 1987752822,
                    "commitment_balance_revised": 0,
                    "contractors_executed": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_executed": 0,
                    "dedicated_revised": -196152000,
                    "depth": 3,
                    "gross_executed": 0,
                    "gross_revised": 196152000,
                    "net_executed": 3277266860,
                    "net_revised": 5229136000,
                    "personnel_executed": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 5279746000,
                    "total_direction_income": -50610000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": -28260000,
                    "total_econ_cls_procurement": 1595428000,
                    "total_econ_cls_transfers": 3661968000
                },
                "2021": {
                    "amounts_allocated": 0,
                    "amounts_executed": 0,
                    "amounts_revised": 0,
                    "code_titles": [
                        "00206701:פעילויות ופרוייקטים"
                    ],
                    "commitment_allowance_allocated": 63000000,
                    "commitment_allowance_executed": 15330323,
                    "commitment_allowance_revised": 63000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 2073735179,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_executed": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -182810000,
                    "dedicated_executed": 0,
                    "dedicated_revised": -202476000,
                    "depth": 3,
                    "gross_allocated": 182810000,
                    "gross_executed": 0,
                    "gross_revised": 202476000,
                    "net_allocated": 3260722000,
                    "net_executed": 2565572849,
                    "net_revised": 4670790000,
                    "personnel_allocated": 0,
                    "personnel_executed": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 4670790000,
                    "total_direction_income": 0,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": 7350000,
                    "total_econ_cls_procurement": 1659207000,
                    "total_econ_cls_transfers": 3004233000
                },
                "2022": {
                    "amounts_allocated": 4240,
                    "amounts_revised": 4240,
                    "code_titles": [
                        "00206701:פעילויות ופרוייקטים"
                    ],
                    "commitment_allowance_allocated": 63000000,
                    "commitment_allowance_revised": 63000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -182810000,
                    "dedicated_revised": -147795000,
                    "depth": 3,
                    "gross_allocated": 182810000,
                    "gross_revised": 147795000,
                    "net_allocated": 3677372000,
                    "net_revised": 5772397000,
                    "personnel_allocated": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 5778697000,
                    "total_direction_income": -6300000,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": 1050000,
                    "total_econ_cls_procurement": 1982431000,
                    "total_econ_cls_transfers": 3788916000
                },
                "2023": {
                    "amounts_allocated": 4298,
                    "amounts_revised": 4298,
                    "code_titles": [
                        "00206701:פעילויות ופרוייקטים"
                    ],
                    "commitment_allowance_allocated": 50000000,
                    "commitment_allowance_revised": 50000000,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": -145770000,
                    "dedicated_revised": -145770000,
                    "depth": 3,
                    "gross_allocated": 145770000,
                    "gross_revised": 145770000,
                    "net_allocated": 2675779000,
                    "net_revised": 2675779000,
                    "personnel_allocated": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 2675779000,
                    "total_direction_income": 0,
                    "total_econ_cls_dedicated_income": 0,
                    "total_econ_cls_internal_transfers": 7350000,
                    "total_econ_cls_procurement": 511283000,
                    "total_econ_cls_transfers": 2157146000
                }
            },
            "net_allocated": 3119918000,
            "net_executed": null,
            "net_revised": 3119918000,
            "nice-breadcrumbs": "2020 - 2024 / משרד החינוך / פעולות משלימות לקידום",
            "nice-category": "שירותים חברתיים / חינוך",
            "nice-code": "20.67.01",
            "nice-econ-category": "העברות-תמיכות לפי סעיף 3א, קניות-קניות בארץ, העברות-מוצרים ציבוריים, העברות-שכר עקיף, הכנסות מיועדות-הכנסות תקציב רגיל, העברות  פנים תקציביות-השתתפויות, העברות-רזרבה",
            "nice-prefixes": [
                "0020",
                "002067",
                "00206701",
                "20",
                "20.",
                "20.67",
                "20.67.",
                "20.67.01",
                "2067",
                "206701"
            ],
            "nice-short-category": "חינוך",
            "non_repeating": [
                false
            ],
            "page_title": "תקציב פעילויות ופרוייקטים (20.67.01)",
            "parent": "002067",
            "personnel_allocated": 0,
            "personnel_executed": null,
            "personnel_revised": 0,
            "rev_created_at": "2023-03-23",
            "rev_last_modified_at": "2023-10-01",
            "rev_last_updated_at": "2023-10-01",
            "score": 3119918,
            "semantic_tags": [],
            "simple-code": "206701",
            "title": "פעילויות ופרוייקטים",
            "total_direction_expense": 3119918000,
            "total_direction_income": 0,
            "total_econ_cls_capital_expenditure": null,
            "total_econ_cls_credit": null,
            "total_econ_cls_debt_repayment_interest": null,
            "total_econ_cls_debt_repayment_principal": null,
            "total_econ_cls_dedicated_income": 0,
            "total_econ_cls_income": null,
            "total_econ_cls_income_bank_of_israel": null,
            "total_econ_cls_income_grants": null,
            "total_econ_cls_income_loans": null,
            "total_econ_cls_interim_accounts": null,
            "total_econ_cls_internal_transfers": 7350000,
            "total_econ_cls_investment": null,
            "total_econ_cls_procurement": 761222000,
            "total_econ_cls_reserve": null,
            "total_econ_cls_salaries": null,
            "total_econ_cls_transfers": 2351346000,
            "year": 2024
        }
    ],
    "supportChart": [
        [
            {
                "entity_name": "הסתדרות הנוער עובד והלומד ליד הסתדרות העובדים הכללית החדשה (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580297075",
                "total_amount": 80238382
            },
            {
                "entity_name": "תנועת הצופים העבריים בישראל (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580028454",
                "total_amount": 72404534
            },
            {
                "entity_name": "תנועת בני עקיבא בישראל (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580040343",
                "total_amount": 64344345
            },
            {
                "entity_name": "הסתדרות השומר הצעיר בישראל (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580001659",
                "total_amount": 22171842
            },
            {
                "entity_name": "עמותת תנועת הנוער הדרוזי בישראל (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580300432",
                "total_amount": 19514634
            },
            {
                "entity_name": "תנועת הצופים הערבים בישראל (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580383834",
                "total_amount": 18671867
            },
            {
                "entity_name": "עזרא תנועת הנוער התורני לאומי בארץ-ישראל (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580043297",
                "total_amount": 16350991
            },
            {
                "entity_name": "אריאל - תנועת נוער ישראלית (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580004562",
                "total_amount": 15419401
            },
            {
                "entity_name": "מועצת תנועות הנוער בישראל (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580019982",
                "total_amount": 13844829
            },
            {
                "entity_name": "הנוער הלאומי - בית\"ר (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580038685",
                "total_amount": 13604564
            },
            {
                "entity_name": "תנועת הנוער של האיחוד החקלאי (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580083046",
                "total_amount": 9324677
            },
            {
                "entity_name": "תנועת המכבי הצעיר (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580308930",
                "total_amount": 8831356
            },
            {
                "entity_name": "היכלי ענ\"ג - תנועת נוער (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580398279",
                "total_amount": 8642679
            },
            {
                "entity_name": "המחנות העולים (ע\"ר)",
                "href": "https://next.obudget.org/i/org/association/580240489",
                "total_amount": 7797877
            }
        ],
        {
            "__created_at": "2023-06-11T14:11:48Z",
            "__date_range_from": "2024-01-01",
            "__date_range_months": [
                "2024-01",
                "2024-02",
                "2024-03",
                "2024-04",
                "2024-05",
                "2024-06",
                "2024-07",
                "2024-08",
                "2024-09",
                "2024-10",
                "2024-11",
                "2024-12"
            ],
            "__date_range_to": "2024-12-31",
            "__hash": "d3304f97e123a984b4ff53c7b5ca872b",
            "__is_new": false,
            "__is_stale": true,
            "__last_modified_at": "2023-10-01T12:30:58Z",
            "__last_updated_at": "2023-10-01T12:30:58Z",
            "__next_update_days": 1,
            "__revision": 278,
            "__staleness": 133333,
            "admin_cls_code_0": [
                "1"
            ],
            "amounts_allocated": 0,
            "amounts_executed": null,
            "amounts_revised": 0,
            "charts": [
                {
                    "long_title": "איך התקציב בסעיף זה השתנה לאורך השנים?",
                    "subcharts": [
                        {
                            "chart": [
                                {
                                    "mode": "lines+markers",
                                    "name": "תקציב מקורי",
                                    "x": [
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        0,
                                        99589000,
                                        89863000,
                                        87709000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "אחרי שינויים",
                                    "x": [
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        0,
                                        126946000,
                                        89863000,
                                        87709000
                                    ]
                                },
                                {
                                    "mode": "lines+markers",
                                    "name": "ביצוע בפועל",
                                    "x": [
                                        2021,
                                        2022,
                                        2023,
                                        2024
                                    ],
                                    "y": [
                                        0,
                                        null,
                                        null,
                                        null
                                    ]
                                }
                            ],
                            "layout": {
                                "xaxis": {
                                    "title": "שנה",
                                    "type": "category"
                                },
                                "yaxis": {
                                    "rangemode": "tozero",
                                    "separatethousands": true,
                                    "title": "תקציב ב-₪"
                                }
                            },
                            "long_title": "ערכי התקציב לאורך השנים (כפי שהופיעו בספרי התקציב)",
                            "title": "נומינלית",
                            "type": "plotly"
                        }
                    ],
                    "title": "שינויי תקציב"
                },
                {
                    "chart": {
                        "centerHeight": 75,
                        "centerTitle": "תמיכה בתנועות נוער",
                        "centerWidth": 200,
                        "directionLeft": true,
                        "groups": [
                            {
                                "class": "budget-expense",
                                "flows": [
                                    {
                                        "context": null,
                                        "label": "העברות ותמיכות",
                                        "size": 87709000
                                    }
                                ],
                                "labelTextSize": 14,
                                "leftSide": true,
                                "offset": 100,
                                "roundness": 50,
                                "slope": 1.2,
                                "width": 1
                            }
                        ],
                        "height": "430px",
                        "type": "mushonkey",
                        "width": "100%"
                    },
                    "long_title": "באילו דרכים ושיטות מוציאים את הכסף בסעיף זה?",
                    "title": "דרכי שימוש",
                    "type": "mushonkey"
                }
            ],
            "children": null,
            "code": "0020670142",
            "commitment_allowance_allocated": 0,
            "commitment_allowance_executed": null,
            "commitment_allowance_revised": 0,
            "commitment_balance_allocated": 0,
            "commitment_balance_executed": null,
            "commitment_balance_revised": 0,
            "contractors_allocated": 0,
            "contractors_executed": null,
            "contractors_revised": 0,
            "covid19_expenses_allocated": 0,
            "covid19_expenses_executed": null,
            "covid19_expenses_revised": 0,
            "dedicated_allocated": 0,
            "dedicated_executed": null,
            "dedicated_revised": 0,
            "depth": 4,
            "direction": [
                "הוצאה"
            ],
            "doc_id": "budget/0020670142/2024",
            "econ_cls_json": [
                "[\"003\", \"\\u05d4\\u05e2\\u05d1\\u05e8\\u05d5\\u05ea\", \"035\", \"\\u05ea\\u05de\\u05d9\\u05db\\u05d5\\u05ea \\u05dc\\u05e4\\u05d9 \\u05e1\\u05e2\\u05d9\\u05e3 3\\u05d0\"]"
            ],
            "econ_cls_title_1": [
                "העברות"
            ],
            "econ_cls_title_2": [
                "תמיכות לפי סעיף 3א"
            ],
            "explanation": null,
            "explanation_short": null,
            "explanation_source": null,
            "func_cls_json": [
                "[\"2\", \"\\u05e9\\u05d9\\u05e8\\u05d5\\u05ea\\u05d9\\u05dd \\u05d7\\u05d1\\u05e8\\u05ea\\u05d9\\u05d9\\u05dd\", \"22\", \"\\u05d7\\u05d9\\u05e0\\u05d5\\u05da\"]"
            ],
            "func_cls_title_1": [
                "שירותים חברתיים"
            ],
            "func_cls_title_2": [
                "חינוך"
            ],
            "gross_allocated": 0,
            "gross_executed": null,
            "gross_revised": 0,
            "hierarchy": [
                [
                    "00",
                    "המדינה"
                ],
                [
                    "0020",
                    "משרד החינוך"
                ],
                [
                    "002067",
                    "פעולות משלימות לקידום"
                ],
                [
                    "00206701",
                    "פעילויות ופרוייקטים"
                ]
            ],
            "history": {
                "2021": {
                    "amounts_allocated": 0,
                    "amounts_executed": 0,
                    "amounts_revised": 0,
                    "code_titles": [
                        "0020670142:תמיכה בתנועות נוער"
                    ],
                    "commitment_allowance_allocated": 0,
                    "commitment_allowance_executed": 0,
                    "commitment_allowance_revised": 0,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_executed": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_executed": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_executed": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": 0,
                    "dedicated_executed": 0,
                    "dedicated_revised": 0,
                    "depth": 4,
                    "gross_allocated": 0,
                    "gross_executed": 0,
                    "gross_revised": 0,
                    "net_allocated": 0,
                    "net_executed": 0,
                    "net_revised": 0,
                    "personnel_allocated": 0,
                    "personnel_executed": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 0,
                    "total_econ_cls_transfers": 0
                },
                "2022": {
                    "amounts_allocated": 0,
                    "amounts_revised": 0,
                    "code_titles": [
                        "0020670142:תמיכה בתנועות נוער"
                    ],
                    "commitment_allowance_allocated": 0,
                    "commitment_allowance_revised": 0,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": 0,
                    "dedicated_revised": 0,
                    "depth": 4,
                    "gross_allocated": 0,
                    "gross_revised": 0,
                    "net_allocated": 99589000,
                    "net_revised": 126946000,
                    "personnel_allocated": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 126946000,
                    "total_econ_cls_transfers": 126946000
                },
                "2023": {
                    "amounts_allocated": 0,
                    "amounts_revised": 0,
                    "code_titles": [
                        "0020670142:תמיכה בתנועות נוער"
                    ],
                    "commitment_allowance_allocated": 0,
                    "commitment_allowance_revised": 0,
                    "commitment_balance_allocated": 0,
                    "commitment_balance_revised": 0,
                    "contractors_allocated": 0,
                    "contractors_revised": 0,
                    "covid19_expenses_allocated": 0,
                    "covid19_expenses_revised": 0,
                    "dedicated_allocated": 0,
                    "dedicated_revised": 0,
                    "depth": 4,
                    "gross_allocated": 0,
                    "gross_revised": 0,
                    "net_allocated": 89863000,
                    "net_revised": 89863000,
                    "personnel_allocated": 0,
                    "personnel_revised": 0,
                    "total_direction_expense": 89863000,
                    "total_econ_cls_transfers": 89863000
                }
            },
            "net_allocated": 87709000,
            "net_executed": null,
            "net_revised": 87709000,
            "nice-breadcrumbs": "2021 - 2024 / משרד החינוך / פעולות משלימות לקידום / פעילויות ופרוייקטים",
            "nice-category": "שירותים חברתיים / חינוך",
            "nice-code": "20.67.01.42",
            "nice-econ-category": "העברות-תמיכות לפי סעיף 3א",
            "nice-prefixes": [
                "0020",
                "002067",
                "00206701",
                "0020670142",
                "20",
                "20.",
                "20.67",
                "20.67.",
                "20.67.01",
                "20.67.01.",
                "20.67.01.42",
                "2067",
                "206701",
                "20670142"
            ],
            "nice-short-category": "חינוך",
            "non_repeating": [
                false
            ],
            "page_title": "תקציב תמיכה בתנועות נוער (20.67.01.42)",
            "parent": "00206701",
            "personnel_allocated": 0,
            "personnel_executed": null,
            "personnel_revised": 0,
            "rev_created_at": "2023-06-11",
            "rev_last_modified_at": "2023-10-01",
            "rev_last_updated_at": "2023-10-01",
            "score": 87709,
            "semantic_tags": [],
            "simple-code": "20670142",
            "title": "תמיכה בתנועות נוער",
            "total_direction_expense": 87709000,
            "total_direction_income": null,
            "total_econ_cls_capital_expenditure": null,
            "total_econ_cls_credit": null,
            "total_econ_cls_debt_repayment_interest": null,
            "total_econ_cls_debt_repayment_principal": null,
            "total_econ_cls_dedicated_income": null,
            "total_econ_cls_income": null,
            "total_econ_cls_income_bank_of_israel": null,
            "total_econ_cls_income_grants": null,
            "total_econ_cls_income_loans": null,
            "total_econ_cls_interim_accounts": null,
            "total_econ_cls_internal_transfers": null,
            "total_econ_cls_investment": null,
            "total_econ_cls_procurement": null,
            "total_econ_cls_reserve": null,
            "total_econ_cls_salaries": null,
            "total_econ_cls_transfers": 87709000,
            "year": 2024
        }
    ],
    "proposalAmount": null,
    "prevProposalAmount": 484784569000,
    "explanations": [
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null,
        null
    ]
};